Frank-Bemelman/HaniMandl-for-ESP32DEV/src/hani-mandl-esp32dev.cpp
// HaniMandl rewrite by Frank
// For readabilty, I removed and changed as I saw fit
// Supports only 320x240 color tft display ST7789
// Code provided as is, use as you please

#include <Arduino.h>
#include <Wire.h>
#include <ESP32Servo.h>             /* aus dem Bibliotheksverwalter */
#include <Adafruit_INA219.h>        /* aus dem Bibliotheksverwalter */
#include <Preferences.h>            /* aus dem BSP von expressif, wird verfügbar wenn das richtige Board ausgewählt ist */
#include <nvs_flash.h>              /* aus dem BSP von expressif, wird verfügbar wenn das richtige Board ausgewählt ist */
#include <Arduino_GFX_Library.h>    /* aus dem Bibliotheksverwalter */
#include <TFT_eSPI.h>               // more versatile display library

#include "hani.h"
#include "Arialbd72.h"
#include <HX711_ADC.h>
#include "menustructure.h"

// Version
String version = "V1.0 by F.";
extern void SetupMyDisplay(void);
extern void TFT_line_print(int line, const char *content);
extern void TFT_line_color(int line, int textcolor, int backgroundcolor);
extern void TFT_line_blink(int line, bool blink);  
extern void SetupButtons(void);
extern void ReadButtons(void * pvParameters);
extern void SelectMenu(int menu);
extern void Menu(void);  // big new menu handler
extern bool IsPulsed(bool *button);

extern bool bScrollNow;
extern bool bUpdateDisplay;
extern bool bBlinkDisplay;
extern int  BlinkTimer10mS;

extern int NewHaniDisplayMode;
extern int ActLcdMode;
extern int NewWeight;
extern int OldWeight;

extern volatile bool deb_start_button;
extern volatile bool deb_stop_button;
extern volatile bool deb_encoder_button;
extern volatile bool deb_setup_switch;
extern volatile bool deb_auto_switch;
extern volatile bool deb_manual_switch;

extern bool bStartButtonPulsed;
extern bool bStopButtonPulsed;
extern bool bEncoderButtonPulsed;
extern bool bSetupSwitchPulsed;
extern bool bAutoSwitchPulsed;
extern bool bManualSwitchPulsed;

extern int start_button_f;
extern int stop_button_f;
extern int encoder_button_f;
extern int setup_switch_f;
extern int auto_switch_f;
extern int manual_switch_f;

extern int start_button_very_long_pressed;
extern int stop_button_very_long_pressed;
extern int encoder_button_very_long_pressed;
extern int setup_switch_very_long_pressed;
extern int auto_switch_very_long_pressed;
extern int manual_switch_very_long_pressed;

// setup menu 
int LastMenu = 0;    // last menu used, for comfortable re-entry
int CurrentMenu = 0; // 
int EditMenu = 0; // 


//HX711 constructor:
const int HX711_dout = 35; //mcu > HX711 dout pin, must be external interrupt capable!
const int HX711_sck = 17; //mcu > HX711 sck pin
HX711_ADC LoadCell(HX711_dout, HX711_sck);
float calibrationValue;
volatile boolean newDataReady;

extern void processAutomatik2(void);
void SetDefaultParameters(void);
void SaveParameters(void);
void LoadParameters(void);

//
// Hier den Code auf die verwendete Hardware einstellen
//

#define ROTARY_SCALE 2         // number of steps for each click of your rotary encoder used
// Ende Benutzereinstellungen!
// 

//
// Ab hier nur verstellen wenn Du genau weisst, was Du tust!
//
//#define isDebug 4             // serielle debug-Ausgabe aktivieren. Mit > 3 wird jeder Messdurchlauf ausgegeben
                                // mit 4 zusätzlich u.a. Durchlaufzeiten
                                // mit 5 zusätzlich rotary debug-Infos
                                // ACHTUNG: zu viel Serieller Output kann einen ISR-Watchdog Reset auslösen!

#define MAXIMALGEWICHT 4500     // maximum allowed weight in gram - 1500 for 2kg loadcell - 4500 for 5kg loadcell

// INA 219
Adafruit_INA219 ina219;


Arduino_DataBus *bus = new Arduino_HWSPI(13 /* DC */, 5 /* CS */);
Arduino_GFX *gfx = new Arduino_ST7789(bus, 14 /* RST */, 3 /* rotation */);
//Arduino_GFX *gfx;

// Fonts
#include "./Fonts/Punk_Mono_Bold_120_075.h"           //10 x 7
#include "./Fonts/Punk_Mono_Bold_160_100.h"           //13 x 9
#include "./Fonts/Punk_Mono_Bold_200_125.h"           //16 x 12
#include "./Fonts/Punk_Mono_Bold_240_150.h"           //19 x 14
//#include "./Fonts/Punk_Mono_Bold_280_175.h"          //22 x 16
#include "./Fonts/Punk_Mono_Bold_320_200.h"           //25 x 18
#include "./Fonts/Punk_Mono_Bold_600_375.h"           //48 x 36
#include "./Fonts/Punk_Mono_Thin_120_075.h"           //10 x 7
#include "./Fonts/Punk_Mono_Thin_160_100.h"           //13 x 9
#include "./Fonts/Punk_Mono_Thin_240_150.h"           //19 x 14
#include "./Fonts/Icons_Start_Stop.h"                 //A=Start, B=Stop, M=Rahmen
#include "./Fonts/Checkbox.h"                         //A=OK, B=nOK

// new display control with TFT_eSPI
// Display ST7789 - set per build flags in platformio.ini
// no changes made to TFT_ESPI library
// TFT_MISO=19  ; not available on my ST7789, combined with SDA MOSI=23
// TFT_MOSI=23  ; SDA of ST7789
// TFT_SCLK=18  ; SCL of ST7789
extern TFT_eSPI tft;  // invoke TFT_eSPI library in hani-display.cpp

// Hardware Pin Definitions located in HANI.H
// Target ESP32-DEVKIT 30 Pins Connector

// Buzzer and LED
static int buzzer_pin = 25;
int led_pin = 0;

Servo servo;
Preferences preferences;

// Denstrukturen für Rotary Encoder
struct rotary {                        
  int Value;
  int Minimum;
  int Maximum;
  int Step;
};

struct rotary rotaries[3]; // will be initialized in setup()
int rotary_select = SW_WINKEL;

JarType JarTypes[6] = {{"DE Imker Bund","DIB",-9999},{"TwistOff","TOF",-9999},{"DeepTwist","DEE",-9999},{"Special Jar","SPX",-9999},{"Ferry's DeLuxe","FDL",-9999},{"Eco Jar","ECO",-9999}}; // name and shortname
JarParameter Jars[6] = {{125, 0, 0, 0}, // net weight, glass, tripcount, counter
                        {250, 1, 0, 0},
                        {250, 2, 0, 0},
                        {500, 1, 0, 0},
                        {450, 4, 0, 0},
                        {500, 5, 0, 0}};
 

// Allgemeine Variablen
int i;                              // allgemeine Zählvariable
int pos;                            // aktuelle Position des Poti bzw. Rotary 
int gewicht;                        // aktuelles Gewicht
int tara;                           // Tara für das ausgewählte Glas, für Automatikmodus
int tara_glas;                      // Tara für das aktuelle Glas, falls Glasgewicht abweicht
long gewicht_leer;                  // Gewicht der leeren Waage
float faktor;                       // Skalierungsfaktor für Werte der Waage
int fmenge;                         // ausgewählte Füllmenge
int fmenge_index;                   // Index in gläser[]
int korrektur;                      // Korrekturwert für Abfüllmenge
int autostart;                      // Vollautomatik ein/aus
int autokorrektur;                  // Autokorrektur ein/aus
int kulanz_gr;                      // gewollte Überfüllung im Autokorrekturmodus in Gramm
int winkel;                         // aktueller Servo-Winkel
int winkel_hard_min = 0;            // Hard-Limit für Servo
int winkel_hard_max = 180;          // Hard-Limit für Servo
int winkel_min = 0;                 // konfigurierbar im Setup
int winkel_max = 85;                // konfigurierbar im Setup
int winkel_fein = 35;               // konfigurierbar im Setup
float fein_dosier_gewicht = 60;     // float wegen Berechnung des Schliesswinkels
int servo_aktiv = 0;                // Servo aktivieren ja/nein
int kali_gewicht = 500;             // frei wählbares Gewicht zum kalibrieren
char ausgabe[256];                  // FB: Increased lenght for use with long scrolling texts
int modus = -1;                     // Bei Modus-Wechsel den Servo auf Minimum fahren
int auto_aktiv = 0;                 // Für Automatikmodus - System ein/aus?
int waage_vorhanden = 0;            // HX711 nicht ansprechen, wenn keine Waage angeschlossen ist, sonst Crash
long preferences_chksum;            // Checksumme, damit wir nicht sinnlos Prefs schreiben
int buzzermode = 0;                 // 0 = aus, 1 = ein.
int ledmode = 0;                    // 0 = aus, 1 = ein.
bool gezaehlt = true;               // Kud Zähl-Flag
int glastoleranz = 20;              // Gewicht für autostart darf um +-20g schwanken, insgesamt also 40g!
int MenuepunkteAnzahl;              // Anzahl Menüpunkte im Setupmenü
int lastpos = 0;                    // Letzte position im Setupmenü
int progressbar = 0;                // Variable für den Progressbar
int showlogo = 1;                   // 0 = aus, 1 = ein
int showcredits = 1;                // 0 = aus, 1 = ein
bool bINA219_installed = false;     
int current_servo = 0;              // 0 = INA219 wird ignoriert, 1-1000 = erlaubter Maximalstrom vom Servo in mA
int current_mA;                     // Strom welcher der Servo zieht
int updatetime_ina219 = 500;        // Zeit in ms in welchem der INA219 gelesen wird (500 -> alle 0,5 sek wird eine Strommessung vorgenommen)
int last_ina219_measurement = 0;    // Letzte Zeit in welcher der Strom gemessen wurde
int overcurrenttime = 1500;         // Zeit in welcher der Servo mehr Strom ziehen darf als einfestellt in ms
int last_overcurrenttime = 0;       // Letzte Zeit in welcher keinen Ueberstrom gemessen wurde
int alarm_overcurrent = 0;          // Alarmflag wen der Servo zuwiel Strom zieht
int show_current = 0;               // 0 = aus, 1 = ein / Zeige den Strom an auch wenn der INA ignoriert wird
int inawatchdog = 1;                // 0 = aus, 1 = ein / wird benötigt um INA messung auszusetzen
int offset_winkel = 0;              // Offset in Grad vom Schlieswinkel wen der Servo Überstrom hatte (max +3Grad vom eingestelten Winkel min)
int color_scheme = 0;               // 0 = dunkel, 1 = hell / Wechsel vom color scheme für den TFT Display
int color_marker_idx = 3;           // Farbe für den Marker für das TFT Display
bool bOldMenu = false;               // use old rolling menu

//Variablen für TFT update
bool no_ina;
int gewicht_alt;
int winkel_min_alt;
int pos_alt;
int winkel_ist_alt;
int tara_alt;
int current_mA_alt;
int servo_aktiv_alt;
int auto_aktiv_alt;
int glas_alt;
int korr_alt;
int rotary_select_alt;
int autokorr_gr_alt;

