Frank-Bemelman/HaniMandl-for-ESP32DEV/src/hani-mandl-esp32dev.cpp
int SysParams[LASTPARAMETER];

//Color Scheme für den TFT Display
unsigned long  COLOR_BACKGROUND;
unsigned long  COLOR_TEXT;
unsigned long  COLOR_MENU_POS1;
unsigned long  COLOR_MENU_POS2;
unsigned long  COLOR_MENU_POS3;
unsigned long  COLOR_MENU_POS4;
unsigned long  COLOR_MARKER;

// local function declarations
int CenterPosX(const char a[], float font_width, int display_width);
int get_length(const char a[]);
int weight2step(int sum);
int GetCurrent(int count);
int step2weight(int step);
int StringLenght(String a);
void ina219_measurement(void);
void buzzer(byte type);
void print_credits(void);
void print_logo(void);

void tft_colors() {
  if (color_scheme == 0) {          //dunkel
    COLOR_BACKGROUND  = TFT_BLACK;
    COLOR_TEXT        = TFT_WHITE;
    COLOR_MENU_POS1   = 0x73AF;
    COLOR_MENU_POS2   = 0x5AEC;
    COLOR_MENU_POS3   = 0x39C8;
    COLOR_MENU_POS4   = 0x20E6;
  }
  else {                            //hell
    COLOR_BACKGROUND  = TFT_WHITE;
    COLOR_TEXT        = TFT_BLACK;
    COLOR_MENU_POS1   = 0x1082;
    COLOR_MENU_POS2   = 0x2104;
    COLOR_MENU_POS3   = 0x3166;
    COLOR_MENU_POS4   = 0x4208;
  }
}

void tft_marker() {                
  if (color_marker_idx == 0)                              {COLOR_MARKER = 0x05ff;}
  else if (color_marker_idx == 1)                         {COLOR_MARKER = 0x021f;}
  else if (color_marker_idx == 2)                         {COLOR_MARKER = 0x001f;}
  else if (color_marker_idx == 3)                         {COLOR_MARKER = 0x4851;}
  else if (color_marker_idx == 4)                         {COLOR_MARKER = 0xc050;}
  else if (color_marker_idx == 5)                         {COLOR_MARKER = 0xf800;}
  else if (color_marker_idx == 6)                         {COLOR_MARKER = 0xfbc0;}
  else if (color_marker_idx == 7)                         {COLOR_MARKER = 0xfde0;}
  else if (color_marker_idx == 8)                         {COLOR_MARKER = 0xd6e1;}
  else if (color_marker_idx == 9)                         {COLOR_MARKER = 0xffe0;}
  else if (color_marker_idx == 10)                        {COLOR_MARKER = 0x2724;}
  else if (color_marker_idx == 11)                        {COLOR_MARKER = 0x0da1;}
}

// Rotary Taster. Der Interrupt kommt nur im Automatikmodus zum Tragen und nur wenn der Servo inaktiv ist.
// Der Taster schaltet in einen von drei Modi, in denen unterschiedliche Werte gezählt werden.
volatile int EncoderSleep10mS;

void IRAM_ATTR isr1() {
  static unsigned long last_interrupt_time = 0; 
  unsigned long interrupt_time = millis();

  if (interrupt_time - last_interrupt_time > 300) {      // If interrupts come faster than 300ms, assume it's a bounce and ignore
    if ( modus == MODE_AUTOMATIK && servo_aktiv == 0 ) { // nur im Automatik-Modus interessiert uns der Click
      rotary_select = (rotary_select + 1) % 3;
      if (rotary_select == SW_KORREKTUR or rotary_select - 1 == SW_KORREKTUR) {
        rotary_select_alt = SW_KORREKTUR;
        korr_alt = -99999;
      }
      if (rotary_select == SW_MENU or rotary_select + 2 == SW_MENU) {
        glas_alt = -1;
      }
      #ifdef isDebug
        Serial.print("Rotary Button changed to ");
        Serial.println(rotary_select);
      #endif 
    }
    last_interrupt_time = interrupt_time;
  }
}

// Rotary Encoder. Counts in one of three rotary structures
// SW_WINKEL    = value set for servo angle
// SW_KORREKTUR = correction factor for filling weight
// SW_MENU      = counter for menu selection or parameter setting
void IRAM_ATTR isr2() {
  static int aState;
  static int bState;
  static int aLastState;
  aState = digitalRead(ROTARY_ENCODER_A); // Reads the "current" state of the encoder
  bState = digitalRead(ROTARY_ENCODER_B); // Reads the "current" state of the encoder
  if (aState != aLastState) {     
    // If the outputB state is different to the outputA state, that means the encoder is turned clockwise
    if (aState != bState) {
      rotaries[rotary_select].Value -= rotaries[rotary_select].Step;
    }
    else {    // counter-clockwise
      rotaries[rotary_select].Value += rotaries[rotary_select].Step;
    }
    rotaries[rotary_select].Value = constrain( rotaries[rotary_select].Value, rotaries[rotary_select].Minimum, rotaries[rotary_select].Maximum);
  }
  aLastState = aState; 
}

//
// Skalierung des Rotaries für verschiedene Rotary Encoder
int getRotariesValue( int rotary_mode ) {
  return ((rotaries[rotary_mode].Value - (rotaries[rotary_mode].Value % (rotaries[rotary_mode].Step * ROTARY_SCALE))) / ROTARY_SCALE );
}

void setRotariesValue( int rotary_mode, int rotary_value ) {
  rotaries[rotary_mode].Value = rotary_value * ROTARY_SCALE;
}

void initRotaries( int rotary_mode, int rotary_value, int rotary_min, int rotary_max, int rotary_step ) {
  rotaries[rotary_mode].Value     = rotary_value * ROTARY_SCALE;
  rotaries[rotary_mode].Minimum   = rotary_min   * ROTARY_SCALE;
  rotaries[rotary_mode].Maximum   = rotary_max   * ROTARY_SCALE;
  rotaries[rotary_mode].Step      = rotary_step;
  #ifdef isDebug
    Serial.print("initRotaries..."); 
    Serial.print(" Rotary Mode: ");  Serial.print(rotary_mode);
    Serial.print(" rotary_value: "); Serial.print(rotary_value);
    Serial.print(" Value: ");        Serial.print(rotaries[rotary_mode].Value);
    Serial.print(" Min: ");          Serial.print(rotaries[rotary_mode].Minimum);
    Serial.print(" Max: ");          Serial.print(rotaries[rotary_mode].Maximum);
    Serial.print(" Step: ");         Serial.print(rotaries[rotary_mode].Step);
    Serial.print(" Scale: ");        Serial.println(ROTARY_SCALE);
  #endif
}
// Ende Funktionen für den Rotary Encoder
//
boolean EncoderButtonTapped(void)
{ if (digitalRead(ENCODER_BUTTON) == LOW) {
    while(digitalRead(ENCODER_BUTTON) == LOW);
    return true;
  }  
  else return false;
}    

boolean EncoderButtonPressed(void)
{ if (digitalRead(ENCODER_BUTTON) == LOW) {
    return true;
  }
  else return false;
}  



void getPreferences(void) {
  preferences.begin("EEPROM", false);                     // Parameter aus dem EEPROM lesen
  faktor          = preferences.getFloat("faktor", 0.0);  // falls das nicht gesetzt ist -> Waage ist nicht kalibriert
  pos             = preferences.getUInt("pos", 0);
  gewicht_leer    = preferences.getUInt("gewicht_leer", 0); 
  korrektur       = preferences.getUInt("korrektur", 0);
  autostart       = preferences.getUInt("autostart", 0);
  autokorrektur   = preferences.getUInt("autokorrektur", 0);
  kulanz_gr       = preferences.getUInt("kulanz_gr", 5);
  fmenge_index    = preferences.getUInt("fmenge_index", 3);
  winkel_min      = preferences.getUInt("winkel_min", winkel_min);
  winkel_max      = preferences.getUInt("winkel_max", winkel_max);
  winkel_fein     = preferences.getUInt("winkel_fein", winkel_fein);
  buzzermode      = preferences.getUInt("buzzermode", buzzermode);
  ledmode         = preferences.getUInt("ledmode", ledmode);
  showlogo        = preferences.getUInt("showlogo", showlogo);
  showcredits     = preferences.getUInt("showcredits", showcredits);
  kali_gewicht    = preferences.getUInt("kali_gewicht", kali_gewicht);
  glastoleranz    = preferences.getUInt("glastoleranz", glastoleranz);
  current_servo   = preferences.getUInt("current_servo", current_servo);
  show_current    = preferences.getUInt("show_current", show_current);
  color_scheme    = preferences.getUInt("color_scheme", color_scheme);
  color_marker_idx    = preferences.getUInt("clr_marker_idx", color_marker_idx);
  preferences_chksum = faktor + pos + gewicht_leer + korrektur + autostart + autokorrektur + kulanz_gr + fmenge_index +
                       winkel_min + winkel_max + winkel_fein + buzzermode + ledmode + showlogo + showcredits + 
                       kali_gewicht + current_servo + glastoleranz + show_current + color_scheme + color_marker_idx;
  i = 0;
  int ResetGewichte[] = {125,250,250,500,500,};
  int ResetGlasTyp[] = {0,1,2,1,0,};
  while( i < 5) {
    sprintf(ausgabe, "Gewicht%d", i);
//    Jars[i].Gewicht = preferences.getInt(ausgabe, ResetGewichte[i]);
    preferences_chksum += Jars[i].Gewicht;
    sprintf(ausgabe, "GlasTyp%d", i);
//    Jars[i].GlasTyp = preferences.getInt(ausgabe, ResetGlasTyp[i]);
    preferences_chksum += Jars[i].GlasTyp;
    sprintf(ausgabe, "Tara%d", i);
//    JarTypes[i].tarra= preferences.getInt(ausgabe, -9999);
    preferences_chksum += JarTypes[i].tarra;
    sprintf(ausgabe, "TripCount%d", i);
//    Jars[i].TripCount = preferences.getInt(ausgabe, 0);
    preferences_chksum += Jars[i].TripCount;
    sprintf(ausgabe, "Count%d", i);
//    Jars[i].Count = preferences.getInt(ausgabe, 0);
    preferences_chksum += Jars[i].Count;
    i++;
  }
  preferences.end();
  #ifdef isDebug
    Serial.println("get Preferences:");
    Serial.print("pos = ");             Serial.println(pos);
    Serial.print("faktor = ");          Serial.println(faktor);
    Serial.print("gewicht_leer = ");    Serial.println(gewicht_leer);
    Serial.print("korrektur = ");       Serial.println(korrektur);
    Serial.print("autostart = ");       Serial.println(autostart);
    Serial.print("autokorrektur = ");   Serial.println(autokorrektur);
    Serial.print("kulanz_gr = ");       Serial.println(kulanz_gr);
    Serial.print("fmenge_index = ");    Serial.println(fmenge_index);
    Serial.print("winkel_min = ");      Serial.println(winkel_min);
    Serial.print("winkel_max = ");      Serial.println(winkel_max);
    Serial.print("winkel_fein = ");     Serial.println(winkel_fein);
    Serial.print("buzzermode = ");      Serial.println(buzzermode);
    Serial.print("ledmode = ");         Serial.println(ledmode);
    Serial.print("showlogo = ");        Serial.println(showlogo);
    Serial.print("showcredits = ");     Serial.println(showcredits);
    Serial.print("current_servo = ");   Serial.println(current_servo);
    Serial.print("color_scheme = ");    Serial.println(color_scheme);
    Serial.print("color_marker_idx = ");    Serial.println(color_marker_idx);
    Serial.print("kali_gewicht = ");    Serial.println(kali_gewicht);
    Serial.print("glastoleranz = ");    Serial.println(glastoleranz);
    Serial.print("show_current = ");    Serial.println(show_current);
    i = 0;
    while( i < 5 ) {
      sprintf(ausgabe, "Gewicht%d = ", i);
      Serial.print(ausgabe);         
      Serial.println(Jars[i].Gewicht);
      sprintf(ausgabe, "GlasTyp%d = ", i);
      Serial.print(ausgabe);         
      Serial.println(JarTypes[Jars[i].GlasTyp].shortname);
      sprintf(ausgabe, "Tara%d = ", i);
      Serial.print(ausgabe);         
      Serial.println(Jars[i]JarTypes);
      i++;
    }
    Serial.print("Checksumme:");    
    Serial.println(preferences_chksum);    
  #endif
}

