Frank-Bemelman/HaniMandl-for-ESP32DEV/src/hani-mandl-esp32dev.cpp
void setPreferences(void) {
  long preferences_newchksum;
  int winkel = getRotariesValue(SW_WINKEL);
  int i;
  preferences.begin("EEPROM", false);
  // Winkel-Einstellung separat behandeln, ändert sich häufig
  if ( winkel != preferences.getUInt("pos", 0) ) {
    preferences.putUInt("pos", winkel);
    #ifdef isDebug
      Serial.print("winkel gespeichert: ");
      Serial.println(winkel);
    #endif
  }
  // Counter separat behandeln, ändert sich häufig
  for ( i=0 ; i < 5; i++ ) {
    sprintf(ausgabe, "TripCount%d", i);
    if (Jars[i].TripCount != preferences.getInt(ausgabe, 0)) {
      preferences.putInt(ausgabe, Jars[i].TripCount);
    }
    sprintf(ausgabe, "Count%d", i);
    if (Jars[i].Count != preferences.getInt(ausgabe, 0)) {
      preferences.putInt(ausgabe, Jars[i].Count);
    }
    #ifdef isDebug
      Serial.print("Counter gespeichert: Index ");
      Serial.print(i);
      Serial.print(" Trip ");
      Serial.print(Jars[fmenge_index].TripCount);
      Serial.print(" Gesamt ");
      Serial.println(Jars[fmenge_index].Count);      
    #endif
  }
  // Den Rest machen wir gesammelt, das ist eher statisch
  preferences_newchksum = faktor + gewicht_leer + korrektur + autostart + autokorrektur +
                          fmenge_index + winkel_min + winkel_max + winkel_fein + kulanz_gr +
                          buzzermode + ledmode + showlogo + showcredits + current_servo + kali_gewicht + 
                          glastoleranz + show_current + color_scheme + color_marker_idx;
  i = 0;
  while( i < 5 ) {
    preferences_newchksum += Jars[i].Gewicht;
    preferences_newchksum += Jars[i].GlasTyp;
    preferences_newchksum += JarTypes[i].tarra;
    i++;
  }
  if( preferences_newchksum == preferences_chksum ) {
    #ifdef isDebug
      Serial.println("Preferences unverändert");
    #endif
    return;
  }
  preferences_chksum = preferences_newchksum;
  preferences.putFloat("faktor", faktor);
  preferences.putUInt("gewicht_leer", gewicht_leer);
  preferences.putUInt("korrektur", korrektur);
  preferences.putUInt("autostart", autostart);
  preferences.putUInt("autokorrektur", autokorrektur);
  preferences.putUInt("kulanz_gr", kulanz_gr);
  preferences.putUInt("winkel_min", winkel_min);
  preferences.putUInt("winkel_max", winkel_max);
  preferences.putUInt("winkel_fein", winkel_fein);
  preferences.putUInt("fmenge_index", fmenge_index);
  preferences.putUInt("buzzermode", buzzermode);
  preferences.putUInt("ledmode", ledmode);
  preferences.putUInt("showlogo", showlogo);
  preferences.putUInt("showcredits", showcredits);
  preferences.putUInt("kali_gewicht", kali_gewicht);
  preferences.putUInt("glastoleranz", glastoleranz);
  preferences.putUInt("current_servo", current_servo);
  preferences.putUInt("show_current", show_current);
  preferences.putUInt("color_scheme", color_scheme);
  preferences.putUInt("clr_marker_idx", color_marker_idx);
  i = 0;
  while( i < 5 ) {
    sprintf(ausgabe, "Gewicht%d", i);
    preferences.putInt(ausgabe, Jars[i].Gewicht);
    sprintf(ausgabe, "GlasTyp%d", i);
    preferences.putInt(ausgabe, Jars[i].GlasTyp);  
    sprintf(ausgabe, "Tara%d", i);
    preferences.putInt(ausgabe, JarTypes[i].tarra);
    i++;
  }
  preferences.end();
  #ifdef isDebug
    Serial.println("Set Preferences:");
    Serial.print("pos = ");             Serial.println(winkel);
    Serial.print("faktor = ");          Serial.println(faktor);
    Serial.print("gewicht_leer = ");    Serial.println(gewicht_leer);
    Serial.print("korrektur = ");       Serial.println(korrektur);
    Serial.print("autostart = ");       Serial.println(autostart);
    Serial.print("autokorrektur = ");   Serial.println(autokorrektur);
    Serial.print("kulanz_gr = ");       Serial.println(kulanz_gr);
    Serial.print("fmenge_index = ");    Serial.println(fmenge_index);
    Serial.print("winkel_min = ");      Serial.println(winkel_min);
    Serial.print("winkel_max = ");      Serial.println(winkel_max);
    Serial.print("winkel_fein = ");     Serial.println(winkel_fein);
    Serial.print("buzzermode = ");      Serial.println(buzzermode);
    Serial.print("ledmode = ");         Serial.println(ledmode);
    Serial.print("showlogo = ");        Serial.println(showlogo);
    Serial.print("showcredits = ");     Serial.println(showcredits);
    Serial.print("current_servo = ");   Serial.println(current_servo);
    Serial.print("kali_gewicht = ");    Serial.println(kali_gewicht);
    Serial.print("glastoleranz = ");    Serial.println(glastoleranz);
    Serial.print("show_current = ");    Serial.println(show_current);
    Serial.print("color_scheme = ");    Serial.println(color_scheme);
    Serial.print("color_marker_idx = ");    Serial.println(color_marker_idx);
    i = 0;
    while( i < 5 ) {
      sprintf(ausgabe, "Gewicht%d = ", i);
      Serial.print(ausgabe);         Serial.println(Jars[i].Gewicht);
      sprintf(ausgabe, "GlasTyp%d = ", i);
      Serial.print(ausgabe);         Serial.println(JarTypes[Jars[i].GlasTyp].shortname);
      sprintf(ausgabe, "Tara%d = ", i);
      Serial.print(ausgabe);         Serial.println(JarTypes[i].tarra);
      i++;
    }
  #endif
}

void setupTripCounter(void) {
  int j;
  i = 1;
  float TripAbfuellgewicht = 0;
  int y_offset_tft = 28;
  const char title[] = "Zählwerk Trip";
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  int x_pos = CenterPosX(title, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(title);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  while (i > 0) { //Erster Screen: Anzahl pro Glasgröße
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    for(int j=0;j<5;j++) {
      gfx->setCursor(5, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%4dg %3s", Jars[j].Gewicht, JarTypes[Jars[j].GlasTyp].shortname);
      gfx->print(ausgabe);
      gfx->setCursor(110, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%11d St.", Jars[j].TripCount);
      gfx->print(ausgabe);
    }
    if (EncoderButtonTapped()) {
      //verlasse Screen
      i = 0;
      gfx->fillRect(0, 31, 320, 209, COLOR_BACKGROUND);
    }
  }
  i = 1;
  while (i > 0) { //Zweiter Screen: Gewicht pro Glasgröße
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    for(int j=0;j<5;j++) {
      gfx->setCursor(5, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%4dg %3s", Jars[j].Gewicht,JarTypes[Jars[j].GlasTyp].shortname);
      gfx->print(ausgabe);
      gfx->setCursor(150, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%10.3fkg", Jars[j].Gewicht * Jars[j].TripCount / 1000.0);
      gfx->print(ausgabe);
    }
    if (EncoderButtonTapped()) {
      //verlasse Screen
      i = 0;
      gfx->fillRect(0, 31, 320, 209, COLOR_BACKGROUND);
    }
  }
  i = 1;
  while (i > 0) { //Dritter Screen: Gesamtgewicht
    TripAbfuellgewicht = 0;
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    for(int j=0;j<5;j++) {
      TripAbfuellgewicht += Jars[j].Gewicht * Jars[j].TripCount / 1000.0;
    }
    gfx->setFont(Punk_Mono_Bold_600_375);
    sprintf(ausgabe, "Summe");
    x_pos = CenterPosX(ausgabe, 36, 320);
    gfx->setCursor(x_pos, 124);
    gfx->print(ausgabe);
    sprintf(ausgabe, "%.1fkg", TripAbfuellgewicht);
    x_pos = CenterPosX(ausgabe, 36, 320);
    gfx->setCursor(x_pos, 184);
    gfx->print(ausgabe);
    gfx->setFont(Punk_Mono_Bold_240_150);
    if (digitalRead(ENCODER_BUTTON) == LOW) {
      //verlasse Screen
      while(digitalRead(ENCODER_BUTTON) == LOW);
      i = 0;
      gfx->fillRect(0, 31, 320, 209, COLOR_BACKGROUND);
    }
  }
  i = 1;
  while (i > 0) { //Vierter Screen: Zurücksetzen
    initRotaries(SW_MENU, 1, 0, 1, -1);
    rotaries[SW_MENU].Value = 1;
    i = 1;
    while (i > 0) {
      if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
        while (digitalRead(BUTTON_STOP) == HIGH);
        modus = -1;
        return;
      }
      pos = getRotariesValue(SW_MENU);
      gfx->setCursor(5, 30+(1 * y_offset_tft));
      if (pos == 0) {gfx->setTextColor(COLOR_MARKER);}
      else {gfx->setTextColor(COLOR_TEXT);}
      gfx->print("Reset");
      gfx->setCursor(5, 30+(2 * y_offset_tft));
      if (pos == 1) {gfx->setTextColor(COLOR_MARKER);}
      else {gfx->setTextColor(COLOR_TEXT);}
      gfx->print("Abbrechen");
      if (digitalRead(ENCODER_BUTTON) == LOW) {
        gfx->setTextColor(COLOR_MARKER);
        gfx->setCursor(283, 30+((pos+1) * y_offset_tft));
        gfx->print("OK");
        if ( pos == 0) {
          for(int j=0;j<5;j++)Jars[j].TripCount = 0;
          setPreferences();
        }
        delay(1000);
        modus = -1;
        i = 0;
      }
    }
  }
}

void setupCounter(void) {
  int j;
  i = 1;
  float Abfuellgewicht = 0;
  int y_offset_tft = 28;
  const char title[] = "Zählwerk";
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  int x_pos = CenterPosX(title, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(title);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  while (i > 0) { //Erster Screen: Anzahl pro Glasgröße
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    for(int j=0;j<5;j++) {
      gfx->setCursor(5, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%4dg %3s", Jars[j].Gewicht,JarTypes[Jars[j].GlasTyp].shortname);
      gfx->print(ausgabe);
      gfx->setCursor(110, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%11d St.", Jars[j].Count);
      gfx->print(ausgabe);
    }
    if (EncoderButtonTapped()) {
      //verlasse Screen
      i = 0;
      gfx->fillRect(0, 31, 320, 209, COLOR_BACKGROUND);
    }
  }
  i = 1;
  while (i > 0) { //Zweiter Screen: Gewicht pro Glasgröße
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    for(int j=0;j<5;j++) {
      gfx->setCursor(5, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%4dg %3s", Jars[j].Gewicht,JarTypes[Jars[j].GlasTyp].shortname);
      gfx->print(ausgabe);
      gfx->setCursor(150, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%10.3fkg", Jars[j].Gewicht * Jars[j].Count / 1000.0);
      gfx->print(ausgabe);
    }
    if (EncoderButtonTapped()) {
      //verlasse Screen
      i = 0;
      gfx->fillRect(0, 31, 320, 209, COLOR_BACKGROUND);
    }
  }
  i = 1;
  while (i > 0) { //Dritter Screen: Gesamtgewicht
    Abfuellgewicht = 0;
    if (digitalRead(BUTTON_STOP) == HIGH  or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    for(int j=0;j<5;j++)Abfuellgewicht += Jars[j].Gewicht * Jars[j].Count / 1000.0;
    gfx->setFont(Punk_Mono_Bold_600_375);
    sprintf(ausgabe, "Summe");
    x_pos = CenterPosX(ausgabe, 36, 320);
    gfx->setCursor(x_pos, 124);
    gfx->print(ausgabe);
    sprintf(ausgabe, "%.1fkg", Abfuellgewicht);
    x_pos = CenterPosX(ausgabe, 36, 320);
    gfx->setCursor(x_pos, 184);
    gfx->print(ausgabe);
    gfx->setFont(Punk_Mono_Bold_240_150);
    if (EncoderButtonTapped()) {
      //verlasse Screen
      i = 0;
      gfx->fillRect(0, 31, 320, 209, COLOR_BACKGROUND);
    }
  }
  i = 1;
  while (i > 0) { //Vierter Screen: Zurücksetzen
    initRotaries(SW_MENU, 1, 0, 1, -1);
    rotaries[SW_MENU].Value = 1;
    i = 1;
    while (i > 0) {
      if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
        while (digitalRead(BUTTON_STOP) == HIGH);
        modus = -1;
        return;
      }
      pos = getRotariesValue(SW_MENU);
      gfx->setCursor(5, 30+(1 * y_offset_tft));
      if (pos == 0) {gfx->setTextColor(COLOR_MARKER);}
      else {gfx->setTextColor(COLOR_TEXT);}
      gfx->print("Reset");
      gfx->setCursor(5, 30+(2 * y_offset_tft));
      if (pos == 1) {gfx->setTextColor(COLOR_MARKER);}
      else {gfx->setTextColor(COLOR_TEXT);}
      gfx->print("Abbrechen");
      if (EncoderButtonPressed()) {
        gfx->setTextColor(COLOR_MARKER);
        gfx->setCursor(283, 30+((pos+1) * y_offset_tft));
        gfx->print("OK");
        if ( pos == 0) {
          for(int j=0;j<5;j++) {
            Jars[j].Count = 0;
            Jars[j].TripCount = 0;
          }
          setPreferences();
        }
        delay(1000);
        modus = -1;
        i = 0;
      }
    }
  }
}

void setupTara(void) {
  int j;
  int x_pos;
  tara = 0;
  initRotaries(SW_MENU, 0, 0, 4, -1);   // Set Encoder to Menu Mode, four Selections, inverted count
  i = 0;
  gfx->fillScreen(COLOR_BACKGROUND);
  bool change = false;
  const char menu[] = "Tarawerte Gläser";
  while (i == 0)  {
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    else if (EncoderButtonPressed()) {
      tara = round(LoadCell.getData());
      if (tara > 20) {                  // Gläser müssen mindestens 20g haben
         JarTypes[getRotariesValue(SW_MENU)].tarra = tara;
      }
      change = true;
      i++;
    }
    if (change) {
      gfx->fillScreen(COLOR_BACKGROUND);
    }
    gfx->setTextColor(COLOR_TEXT);
    gfx->setFont(Punk_Mono_Bold_240_150);
    x_pos = CenterPosX(menu, 14, 320);
    gfx->setCursor(x_pos, 25);
    gfx->println(menu);
    gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
    for(int j=0;j<5;j++) {
      if (j == getRotariesValue(SW_MENU)) {
        gfx->setTextColor(COLOR_MARKER);
      }
      else {
        gfx->setTextColor(COLOR_TEXT);
      }
      gfx->setCursor(5, 60+(j*30));
      if (Jars[j].Gewicht < 1000) {
        sprintf(ausgabe, " %3dg - %3s", Jars[j].Gewicht, JarTypes[Jars[j].GlasTyp].shortname); 
      } 
      else {
        sprintf(ausgabe, "%.1fkg - %3s", float(Jars[j].Gewicht) / 1000, JarTypes[Jars[j].GlasTyp].shortname); 
      }
      gfx->println(ausgabe);
      gfx->setCursor(215, 60+(j*30));
      if (JarTypes[j].tarra > 0) { 
        sprintf(ausgabe, "  %4dg", JarTypes[j].tarra); 
        gfx->print(ausgabe);
      }
      else {
        gfx->print("  fehlt");
      }
    }
  }
  modus = -1;
  delay(2000);
}

void setupCalibration(void) {
  float gewicht_raw;
  gfx->fillScreen(COLOR_BACKGROUND);
  int kali_gewicht_old = -1;
  const char menu[] = "Kalibrieren";
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  int x_pos = CenterPosX(menu, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(menu);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  sprintf(ausgabe, "Bitte Waage leeren");
  x_pos = CenterPosX(ausgabe, 14, 320);
  gfx->setCursor(x_pos, 100); gfx->print(ausgabe);
  sprintf(ausgabe, "und mit OK");
  x_pos = CenterPosX(ausgabe, 14, 320);
  gfx->setCursor(x_pos, 128); gfx->print(ausgabe);
  sprintf(ausgabe, "bestätigen");
  x_pos = CenterPosX(ausgabe, 14, 320);
  gfx->setCursor(x_pos, 156); gfx->print(ausgabe);
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    else if (EncoderButtonPressed()) {
      LoadCell.setCalFactor(1); 
      // scale.set_offset(long(gewicht_leer));
//      scale.set_scale(); // set scale to 1
      LoadCell.tare();
      delay(500);
      i = 0;
    }
  }
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  x_pos = CenterPosX(menu, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(menu);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  initRotaries(SW_MENU, kali_gewicht, 100, 9999, 1); 
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    kali_gewicht = getRotariesValue(SW_MENU);
    if (kali_gewicht != kali_gewicht_old) {
      gfx->setTextColor(COLOR_BACKGROUND);
      if ((kali_gewicht >= 1000 and kali_gewicht_old <= 999) or (kali_gewicht_old >= 1000 and kali_gewicht <= 999)) {
        sprintf(ausgabe, "Bitte %dg", kali_gewicht_old);
      }
      else {
        sprintf(ausgabe, "      %dg", kali_gewicht_old);
      }
      x_pos = CenterPosX(ausgabe, 14, 320);
      gfx->setCursor(x_pos, 100); gfx->print(ausgabe);
      gfx->setTextColor(COLOR_TEXT);
      sprintf(ausgabe, "      %dg", kali_gewicht);
      x_pos = CenterPosX(ausgabe, 14, 320);
      gfx->setCursor(x_pos, 100); gfx->print("Bitte ");
      gfx->setTextColor(COLOR_MARKER);
      gfx->setCursor(x_pos, 100); gfx->print(ausgabe);
      gfx->setTextColor(COLOR_TEXT);
      sprintf(ausgabe, "aufstellen");
      x_pos = CenterPosX(ausgabe, 14, 320);
      gfx->setCursor(x_pos, 128); gfx->print(ausgabe);
      sprintf(ausgabe, "und mit OK");
      x_pos = CenterPosX(ausgabe, 14, 320);
      gfx->setCursor(x_pos, 156); gfx->print(ausgabe);
      sprintf(ausgabe, "bestätigen");
      x_pos = CenterPosX(ausgabe, 14, 320);
      gfx->setCursor(x_pos, 184); gfx->print(ausgabe);

      kali_gewicht_old = kali_gewicht;
    }
    if (EncoderButtonPressed()) {
//      gewicht_raw  = scale.get_units(10);
      gewicht_raw = round(LoadCell.getData());
      faktor       = gewicht_raw / kali_gewicht;
//      scale.set_scale(faktor);
      LoadCell.setCalFactor(faktor); 
      gewicht_leer = LoadCell.getTareOffset();    // Leergewicht der Waage speichern
      #ifdef isDebug
        Serial.print("kalibrier_gewicht = ");
        Serial.println(kali_gewicht);
        Serial.print("gewicht_leer = ");
        Serial.println(gewicht_leer);
        Serial.print("gewicht_raw = ");
        Serial.println(gewicht_raw);
        Serial.print(" Faktor = ");
        Serial.println(faktor);
      #endif        
      delay(1000);
      modus = -1;
      i = 0;        
    }
  }
}

void setupServoWinkel(void) {
  int menuitem;
  int menuitem_used = 4;
  int lastmin  = winkel_min;
  int lastfein = winkel_fein;
  int lastmax  = winkel_max;
  int wert_alt;
  bool wert_aendern = false;
  bool servo_live = false;
  initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
  int y_offset_tft = 28;
  bool change = false;
  int wert_old = -1;
  const char title[] = "Servoeinstellungen";
  int MenuepunkteAnzahl = 5;
  const char *menuepunkte[MenuepunkteAnzahl] = {"Livesetup", "Minimum", "Feindos.", "Maximum", "Speichern"};
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  int x_pos = CenterPosX(title, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(title);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      winkel_min  = lastmin;
      winkel_fein = lastfein;
      winkel_max  = lastmax;
      if (servo_live == true) {
        SERVO_WRITE(winkel_min);
      }
      modus = -1;
      return;
    }
    if (wert_aendern == false) {
      menuitem = getRotariesValue(SW_MENU);
      pos = menuitem;
      if (menuitem == menuitem_used) {
        menuitem = 6;
      }
    }
    else {
      switch (menuitem) {
        case 0: servo_live  = getRotariesValue(SW_MENU);
                break;
        case 1: winkel_min  = getRotariesValue(SW_MENU);
                if (servo_live == true) SERVO_WRITE(winkel_min);
                break;
        case 2: winkel_fein = getRotariesValue(SW_MENU);
                if (servo_live == true) SERVO_WRITE(winkel_fein);
                break;
        case 3: winkel_max  = getRotariesValue(SW_MENU);
                if (servo_live == true) SERVO_WRITE(winkel_max);
                break;
      }
    }
    for(int j=0; j < MenuepunkteAnzahl; j++) {
      gfx->setTextColor(COLOR_TEXT);
      if (j == pos and wert_aendern == false) {
        gfx->setTextColor(COLOR_MARKER);
      }
      if (j < MenuepunkteAnzahl - 1) {
        gfx->setCursor(5, 30+((j+1) * y_offset_tft));
        gfx->print(menuepunkte[j]);
        if (j == pos and wert_aendern == true) {
          sprintf(ausgabe,"(%d°)", wert_alt);
          if (j > 0) {
            gfx->setCursor(170, 30+((j+1) * y_offset_tft));
            gfx->print(ausgabe);
          }
          gfx->setTextColor(COLOR_MARKER);
        }
        switch (j) {
          case 0: sprintf(ausgabe,"%s", servo_live==false?"aus":"ein");
                  if (wert_old != servo_live and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = servo_live;
                  }
                  break;
          case 1: sprintf(ausgabe,"%d°", winkel_min);
                  if (wert_old != winkel_min and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = winkel_min;
                  }
                  break;
          case 2: sprintf(ausgabe,"%d°", winkel_fein);
                  if (wert_old != winkel_fein and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = winkel_fein;
                  }
                  break;
          case 3: sprintf(ausgabe,"%d°", winkel_max);
                  if (wert_old != winkel_max and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = winkel_max;
                  }
                  break;
          }
          if (change) {
            gfx->fillRect(251, 27+((j+1) * y_offset_tft)-19, 64, 25, COLOR_BACKGROUND);
            change = false;
          }
          int y = get_length(ausgabe);
          gfx->setCursor(320 - y * 14 - 5, 30+((j+1) * y_offset_tft));
          gfx->print(ausgabe);
        }
        else {
          gfx->setCursor(5, 30+(7 * y_offset_tft));
          gfx->print(menuepunkte[j]);
        }
      }
    
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == false) {
      while(EncoderButtonPressed());
      switch (menuitem) { 
        case 0: initRotaries(SW_MENU, servo_live, 0, 1, 1);
              break;
        case 1: initRotaries(SW_MENU, winkel_min, winkel_hard_min, winkel_fein, 1);
              wert_alt = lastmin;
              break;
        case 2: initRotaries(SW_MENU, winkel_fein, winkel_min, winkel_max, 1);
              wert_alt = lastfein;
              break;
        case 3: initRotaries(SW_MENU, winkel_max, winkel_fein, winkel_hard_max, 1);
              wert_alt = lastmax;
              break;
      }
      wert_old = -1;
      wert_aendern = true;
    }
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == true) {
      while(EncoderButtonPressed());
      if (servo_live == true) {
        SERVO_WRITE(winkel_min);
      }
      initRotaries(SW_MENU, menuitem, 0, menuitem_used, -1);
      wert_aendern = false;
      gfx->fillRect(170, 30+y_offset_tft+3, 96, 3*y_offset_tft + 2, COLOR_BACKGROUND);
    }
    if (EncoderButtonPressed() && menuitem == 6) {
      while(EncoderButtonPressed());
      gfx->setCursor(283, 30+(7 * y_offset_tft));
      gfx->print("OK");
      modus = -1;
      delay(1000);
      i = 0;
    }
  }
}

