Frank-Bemelman/HaniMandl-for-ESP32DEV/src/hani-mandl-esp32dev.cpp
void setupAutomatik(void) {
  int menuitem;
  int menuitem_used = 5;
  int lastautostart     = autostart;
  int lastglastoleranz  = glastoleranz;
  int lastautokorrektur = autokorrektur;
  int lastkulanz        = kulanz_gr;
  int korrektur_alt = korrektur;
  bool wert_aendern = false;
  int y_offset_tft = 28;
  bool change = false;
  int wert_old = -1;
  const char title[] = "Automatik";
  int MenuepunkteAnzahl = 6;
  const char *menuepunkte[MenuepunkteAnzahl] = {"Autostart", "Glastoleranz", "Korrektur", "Autokorrektur", "-> Kulanz", "Speichern"};
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  int x_pos = CenterPosX(title, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(title);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      autostart     = lastautostart;
      autokorrektur = lastautokorrektur;
      kulanz_gr     = lastkulanz;
      glastoleranz  = lastglastoleranz;
      korrektur     = korrektur_alt;
      setRotariesValue(SW_KORREKTUR, korrektur_alt);
      rotary_select = SW_MENU;
      modus = -1;
      return;
    }
    if (wert_aendern == false) {
      menuitem = getRotariesValue(SW_MENU);
      pos = menuitem;
      if (menuitem == menuitem_used) {
        menuitem = 6;
      }
    }
    else {
      switch (menuitem) {
        case 0: autostart     = getRotariesValue(SW_MENU);
                break;
        case 1: glastoleranz  = getRotariesValue(SW_MENU);
                break;
        case 2: korrektur     = getRotariesValue(SW_KORREKTUR);
                break;
        case 3: autokorrektur = getRotariesValue(SW_MENU);
                break;
        case 4: kulanz_gr     = getRotariesValue(SW_MENU);
                break;
      }
    }
    // Menu
    for(int j=0; j < MenuepunkteAnzahl; j++) {
      gfx->setTextColor(COLOR_TEXT);
      if (j == pos and wert_aendern == false) {
        gfx->setTextColor(COLOR_MARKER);
      }
      if (j < MenuepunkteAnzahl - 1) {
        gfx->setCursor(5, 30+((j+1) * y_offset_tft));
        gfx->print(menuepunkte[j]);
        if (j == pos and wert_aendern == true) {
          gfx->setTextColor(COLOR_MARKER);
        }
        switch (j) {
          case 0: sprintf(ausgabe,"%s", autostart==false?"aus":"ein");
                  if (wert_old != autostart and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = autostart;
                  }
                  break;
          case 1: if (glastoleranz > 0) {
                    sprintf(ausgabe,"±%dg", glastoleranz);
                  }
                  else {
                    sprintf(ausgabe,"%dg", glastoleranz);
                  }
                  if (wert_old != glastoleranz and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = glastoleranz;
                  }
                  break;
          case 2: sprintf(ausgabe,"%dg", korrektur);
                  if (wert_old != korrektur and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = korrektur;
                  }
                  break;
          case 3: sprintf(ausgabe,"%s", autokorrektur==false?"aus":"ein");
                  if (wert_old != autokorrektur and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = autokorrektur;
                  }
                  break;
          case 4: sprintf(ausgabe,"%dg", kulanz_gr);
                  if (wert_old != kulanz_gr and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = kulanz_gr;
                  }
                  break;
        }
        if (change) {
          gfx->fillRect(251, 27+((j+1) * y_offset_tft)-19, 64, 25, COLOR_BACKGROUND);
          change = false;
        }
        int y = get_length(ausgabe);
        gfx->setCursor(320 - y * 14 - 5, 30+((j+1) * y_offset_tft));
        gfx->print(ausgabe);
      }
      else {
        gfx->setCursor(5, 30+(7 * y_offset_tft));
        gfx->print(menuepunkte[j]);
      }
    }
    // Menupunkt zum Ändern ausgewählt
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == false) { 
      while(EncoderButtonPressed());
      switch (menuitem) { 
        case 0: rotary_select = SW_MENU;
                initRotaries(SW_MENU, autostart, 0, 1, 1);
                break;
        case 1: rotary_select = SW_MENU;
                initRotaries(SW_MENU, glastoleranz, 0, 99, 1);
                break;
        case 2: rotary_select = SW_KORREKTUR;
                break;
        case 3: rotary_select = SW_MENU;
                initRotaries(SW_MENU, autokorrektur, 0, 1, 1);
                break;
        case 4: rotary_select = SW_MENU;
                initRotaries(SW_MENU, kulanz_gr, 0, 99, 1);
                break;
      }
      wert_old = -1;
      wert_aendern = true;
    }
    // Änderung im Menupunkt übernehmen
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == true) {
      while(EncoderButtonPressed());
      rotary_select = SW_MENU;
      initRotaries(SW_MENU, menuitem, 0, menuitem_used, -1);
      wert_aendern = false;
    }
    // Menu verlassen 
    if (EncoderButtonPressed() && menuitem == 6) {
      while(EncoderButtonPressed());
      gfx->setCursor(283, 30+(7 * y_offset_tft));
      gfx->print("OK");
      delay(1000);
      modus = -1;
      i = 0;
    }
  }
  rotary_select = SW_MENU;
}

void setupFuellmenge(void) {
  int y_offset_tft = 28;
  String wert_old = "";
  const char title[] = "Füllmenge Gläser";
  //int MenuepunkteAnzahl = 5;
  //const char *menuepunkte[MenuepunkteAnzahl] = {"Livesetup", "Minimum", "Feindos.", "Maximum", "Speichern"};
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  int x_pos = CenterPosX(title, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(title);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  int j;
  initRotaries(SW_MENU, fmenge_index, 0, 4, -1);
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    pos = getRotariesValue(SW_MENU);
    for(int j=0; j < 5; j++) {
    if (j == pos) {
        gfx->setTextColor(COLOR_MARKER);
      }
      else {
        gfx->setTextColor(COLOR_TEXT);
      }
      gfx->setCursor(10, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%4dg", Jars[j].Gewicht);
      gfx->print(ausgabe);
      gfx->setCursor(110, 30+((j+1) * y_offset_tft));

      gfx->print(JarTypes[Jars[j].GlasTyp].name);
    }
    if (EncoderButtonTapped()) { // Füllmenge gewählt
      i = 0;
    }
  }
  i = 1;
  initRotaries(SW_MENU, weight2step(Jars[pos].Gewicht) , 25, weight2step(MAXIMALGEWICHT), 1);
  while (i > 0){
    if ((digitalRead(BUTTON_STOP)) == HIGH  or digitalRead(SWITCH_SETUP) == LOW) {
      modus = -1;
      return;
    }
    Jars[pos].Gewicht = step2weight(getRotariesValue(SW_MENU));
    for(int j=0; j < 5; j++) {
      gfx->setCursor(10, 30+((j+1) * y_offset_tft));
      if (j == pos) {
        if (wert_old != String(Jars[j].Gewicht)) {
          gfx->fillRect(0, 27+((j+1) * y_offset_tft)-19, 100, 27, COLOR_BACKGROUND);
          wert_old = String(Jars[j].Gewicht);
        }
        gfx->setTextColor(COLOR_MARKER);
      }
      sprintf(ausgabe, "%4dg", Jars[j].Gewicht);
      gfx->print(ausgabe);
      gfx->setTextColor(COLOR_TEXT);
      gfx->setCursor(110, 30+((j+1) * y_offset_tft));
      gfx->print(JarTypes[Jars[j].GlasTyp].name);
    }
    if (EncoderButtonTapped()) { // Gewicht bestätigt
      i = 0;
    }
  }
  i = 1;
  initRotaries(SW_MENU, Jars[pos].GlasTyp, 0, sizeof(JarTypes)/sizeof(JarTypes[0]) - 1, 1);
  while (i > 0){ 
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    Jars[pos].GlasTyp = getRotariesValue(SW_MENU);
    for(int j=0;j<5;j++) {
      gfx->setCursor(10, 30+((j+1) * y_offset_tft));
      sprintf(ausgabe, "%4dg", Jars[j].Gewicht);
      gfx->print(ausgabe);
      if (j == pos) {
        if (wert_old != String(JarTypes[Jars[j].GlasTyp].name)) {
          gfx->fillRect(100, 27+((j+1) * y_offset_tft)-19, 220, 27, COLOR_BACKGROUND);
          wert_old = String(JarTypes[Jars[j].GlasTyp].name);
        }
        gfx->setTextColor(COLOR_MARKER);
      }
      gfx->setCursor(110, 30+((j+1) * y_offset_tft));
gfx->print(JarTypes[Jars[j].GlasTyp].name);
      gfx->setTextColor(COLOR_TEXT);
    }
    if (EncoderButtonTapped()) { //GlasTyp bestätigt
      while(EncoderButtonTapped());
      i = 0;
    }
  }
  fmenge = Jars[pos].Gewicht;
  tara   = JarTypes[pos].tarra;
  fmenge_index = pos; 
  modus = -1;
  i = 0;
}

void setupParameter(void) {
  int menuitem;
  int menuitem_used = 4;
  int lastbuzzer    = buzzermode;
  int lastled       = ledmode;
  int lastlogo      = showlogo;
  int lastcredits   = showcredits;
  int lastcolor_scheme = color_scheme;
  int lastcolor_marker_idx = color_marker_idx;
  bool wert_aendern = false;
  int y_offset_tft = 28;
  int wert_old = -1;
  bool change = false;
  bool change_scheme = true;
  bool change_marker = true;
  const char title[] = "Parameter";
  menuitem_used = 6;
  int MenuepunkteAnzahl = 7;
  const char *menuepunkte[MenuepunkteAnzahl] = {"Buzzer", "LED", "Show Logo", "Show Credits", "Color Scheme", "Color Marker", "Speichern"};
  initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      buzzermode = lastbuzzer;
      ledmode = lastled;
      showlogo = lastlogo;
      showcredits = lastcredits;
      color_scheme = lastcolor_scheme;
      color_marker_idx = lastcolor_marker_idx;
      modus = -1;
      return;
    }
    if (wert_aendern == false) {
      menuitem = getRotariesValue(SW_MENU);
      pos = menuitem;
      if (menuitem == menuitem_used) {
        menuitem = 6;
      }
    }
    else {
      switch (menuitem) {
        case 0: buzzermode    = getRotariesValue(SW_MENU);
                break;
        case 1: ledmode       = getRotariesValue(SW_MENU);
                break;
        case 2: showlogo      = getRotariesValue(SW_MENU);
                break;
        case 3: showcredits   = getRotariesValue(SW_MENU);
                break;
        case 4: color_scheme  = getRotariesValue(SW_MENU);
                break;
        case 5: color_marker_idx  = getRotariesValue(SW_MENU);
                break;
      }
    }
    // Menu
    if(change_scheme) {
      gfx->fillScreen(COLOR_BACKGROUND);
      gfx->setTextColor(COLOR_TEXT);
      gfx->setFont(Punk_Mono_Bold_240_150);
      int x_pos = CenterPosX(title, 14, 320);
      gfx->setCursor(x_pos, 25);
      gfx->println(title);
      gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
      change_scheme = false;
      change_marker = true;
    }
    for(int j=0;j < MenuepunkteAnzahl;j++) {
      gfx->setTextColor(COLOR_TEXT);
      if (j == pos and wert_aendern == false) {
        gfx->setTextColor(COLOR_MARKER);
      }
      if (j < MenuepunkteAnzahl - 1) {
        gfx->setCursor(5, 30+((j+1) * y_offset_tft));
        gfx->print(menuepunkte[j]);
        if (j == pos and wert_aendern == true) {
          gfx->setTextColor(COLOR_MARKER);
        }
        switch (j) {
          case 0: sprintf(ausgabe,"%s", buzzermode==false?"aus":"ein");
                  if (wert_old != buzzermode and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = buzzermode;
                  }
                  break;
          case 1: sprintf(ausgabe,"%s", ledmode==false?"aus":"ein");
                  if (wert_old != ledmode and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = ledmode;
                  }
                  break;
          case 2: sprintf(ausgabe,"%s", showlogo==false?"aus":"ein");
                  if (wert_old != showlogo and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = showlogo;
                  }
                  break;
          case 3: sprintf(ausgabe,"%s", showcredits==false?"aus":"ein");
                  if (wert_old != showcredits and wert_aendern == true and j == pos) {
                    change = true;
                    wert_old = showcredits;
                  }
                  break;
          case 4: sprintf(ausgabe,"%s", color_scheme==false?"dunkel":"hell");
                  if (wert_old != color_scheme and wert_aendern == true and j == pos) {
                    change = true;
                    change_scheme = true;
                    wert_old = color_scheme;
                    tft_colors();
                  }
                  break;
          case 5: sprintf(ausgabe,"");
                  if (wert_old != color_marker_idx and wert_aendern == true and j == pos) {
                    change = true;
                    change_marker = true;
                    wert_old = color_marker_idx;
                    tft_marker();
                  }
                  break;
        }
        if (change) {
          gfx->fillRect(211, 27+((j+1) * y_offset_tft)-19, 104, 25, COLOR_BACKGROUND);
          change = false;
        }
        if (change_marker) {
          gfx->fillRect(265, 27+(6 * y_offset_tft)-17, 45, 21, COLOR_MARKER);
          change_marker = false;
        }
        int y = get_length(ausgabe);
        gfx->setCursor(320 - y * 14 - 5, 30+((j+1) * y_offset_tft));
        gfx->print(ausgabe);
      }
      else {
        gfx->setCursor(5, 30+(7 * y_offset_tft));
        gfx->print(menuepunkte[j]);
      }
    }
    // Menupunkt zum Ändern ausgewählt
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == false) {
      while(EncoderButtonPressed());
      switch (menuitem) { 
        case 0: initRotaries(SW_MENU, buzzermode, 0, 1, 1);
                break;
        case 1: initRotaries(SW_MENU, ledmode, 0, 1, 1);
                break;
        case 2: initRotaries(SW_MENU, showlogo, 0, 1, 1);
                break;
        case 3: initRotaries(SW_MENU, showcredits, 0, 1, 1);
                break;
        case 4: initRotaries(SW_MENU, color_scheme, 0, 1, 1);
                break;
        case 5: initRotaries(SW_MENU, color_marker_idx, 0, 11, 1);
                break;
      }
      wert_old = -1;
      wert_aendern = true;
    }
    // Änderung im Menupunkt übernehmen
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == true) {
      while(EncoderButtonPressed());
      initRotaries(SW_MENU, menuitem, 0, menuitem_used, -1);
      wert_aendern = false;
    }
    // Menu verlassen 
    if (EncoderButtonPressed() && menuitem == 6) {
      while(EncoderButtonPressed());
      gfx->setCursor(283, 30+(7 * y_offset_tft));
      gfx->print("OK");
      delay(1000);
      modus = -1;
      i = 0;
    }
  }
}

void setupClearPrefs(void) {
  initRotaries(SW_MENU, 2, 0, 2, -1);
  int x_pos;
  int y_offset_tft = 28;
  gfx->fillScreen(COLOR_BACKGROUND);
  const char title[] = "Clear Preferences";
  int MenuepunkteAnzahl = 3;
  const char *menuepunkte[MenuepunkteAnzahl - 1] = {"Lösche Preferences", "Lösche NVS memory", "Zurück"};
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  x_pos = CenterPosX(title, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(title);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH  or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      modus = -1;
      return;
    }
    pos = getRotariesValue(SW_MENU);
    for(int j=0;j<MenuepunkteAnzahl;j++) {
      if (j == pos) {
        gfx->setTextColor(COLOR_MARKER);
      }
      else {
        gfx->setTextColor(COLOR_TEXT);
      }
      if (j < MenuepunkteAnzahl - 1) {
        gfx->setCursor(10, 30+((j+1) * y_offset_tft));
        gfx->print(menuepunkte[j]);
      }
      else {
        gfx->setCursor(10, 30+(7 * y_offset_tft));
        gfx->print(menuepunkte[j]);
      }
    }
    if (EncoderButtonTapped()) {  
      if (pos == 0) {
        preferences.begin("EEPROM", false);
        preferences.clear();
        preferences.end();
        //Da machen wir gerade einen restart
        ESP.restart();
      }
      else if (pos == 1) {
        nvs_flash_erase();    // erase the NVS partition and...
        nvs_flash_init();     // initialize the NVS partition.
        //Da machen wir gerade einen restart
        ESP.restart();
      }
      gfx->setCursor(280, 30+(7 * y_offset_tft));
      gfx->print("OK");
      delay(1000);
      modus = -1;
      i = 0;
    }
  }
}

