Frank-Bemelman/HaniMandl-for-ESP32DEV/src/hani-mandl-esp32dev.cpp
void setupINA219(void) {                            //Funktioniert nur wenn beide Menüs die gleiche Anzahl haben. Feel free to change it :-)
  int menuitem;
  int lastcurrent             = current_servo;
  int lastwinkel_min          = winkel_min;
  int lastshow_current        = show_current;
  bool wert_aendern = false;
  int menuitem_used           = 2;
  String kalibration_status   = "Start";
  String quetschhan           = "zu";
  bool cal_done = false;
  int cal_winkel = 0;
  int j=0;
  int k = 0;
  int y_offset_tft = 28;
  bool change = false;
  int wert_old = -1;
  const char title[] = "INA219 Setup";
  int MenuepunkteAnzahl = 3;
  const char *menuepunkte_1[MenuepunkteAnzahl] = {"Servo Strom", "Cal. Quetschhan", "Speichern"};
  const char *menuepunkte_2[MenuepunkteAnzahl] = {"Servo Strom", "Zeige Strom an", "Speichern"};
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setTextColor(COLOR_TEXT);
  gfx->setFont(Punk_Mono_Bold_240_150);
  int x_pos = CenterPosX(title, 14, 320);
  gfx->setCursor(x_pos, 25);
  gfx->println(title);
  gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
  initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
  i = 1;
  while (i > 0) {
    if (digitalRead(BUTTON_STOP) == HIGH  or digitalRead(SWITCH_SETUP) == LOW) {
      while (digitalRead(BUTTON_STOP) == HIGH);
      current_servo = lastcurrent;
      winkel_min = lastwinkel_min;
      show_current = lastshow_current;
      modus = -1;
      return;
    }
    if (wert_aendern == false) {
      menuitem = getRotariesValue(SW_MENU);
      pos = menuitem;
      if (menuitem == menuitem_used) {
        menuitem = 6;
      }
    }
    else {
      switch (menuitem) {
        case 0: current_servo         = getRotariesValue(SW_MENU);
                break;
        case 1: if (current_servo == 0) {
                  show_current = getRotariesValue(SW_MENU);
                }
                else {
                  j                     = 1;
                  kalibration_status    = "Start";
                  wert_aendern          = false;
                  menuitem_used         = 1;
                  setRotariesValue(SW_MENU, 0);
                  initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
                }
                break;
      }
    }
    // Menu
    int a = 0;
    while(a < MenuepunkteAnzahl) {
      gfx->setTextColor(COLOR_TEXT);
      if (a == pos and wert_aendern == false) {
        gfx->setTextColor(COLOR_MARKER);
      }
      if (a < MenuepunkteAnzahl - 1) {
        if (current_servo == 0) {
          gfx->setCursor(5, 30+((a+1) * y_offset_tft));
          gfx->print(menuepunkte_2[a]);
        }
        else {
          gfx->setCursor(5, 30+((a+1) * y_offset_tft));
          gfx->print(menuepunkte_1[a]);
        }
        if (a == pos and wert_aendern == true) {
          gfx->setTextColor(COLOR_MARKER);
        }
        switch (a) {
          case 0: sprintf(ausgabe,"%dmA", current_servo);
                  if (wert_old != current_servo and wert_aendern == true and a == pos) {
                    change = true;
                    wert_old = current_servo;
                  }
                  break;
          case 1: if (current_servo == 0) {
                    sprintf(ausgabe,"%s", show_current==false?"aus":"ein");
                    if (wert_old != show_current and wert_aendern == true and a == pos) {
                      change = true;
                      wert_old = show_current;
                    }
                  }
                  else {
                    sprintf(ausgabe,"%s", "");
                    if (wert_old != show_current and wert_aendern == true and a == pos) {
                      change = true;
                      wert_old = show_current;
                    }
                  }
                  break;
        }
        if (change) {
          if (a == 0) {
            gfx->fillRect(215, 27+((a+1) * y_offset_tft)-19, 100, 25, COLOR_BACKGROUND);
            if (wert_old == 0 or wert_old == 50) {                                                //nicht ganz sauber bei den Schwellwerten. 
              gfx->fillRect(0, 27+((a+2) * y_offset_tft)-19, 320, 27, COLOR_BACKGROUND);
            }
          }
          else {
            gfx->fillRect(251, 27+((a+1) * y_offset_tft)-19, 64, 25, COLOR_BACKGROUND);
          }
          change = false;
        }
        int y = get_length(ausgabe);
        gfx->setCursor(320 - y * 14 - 5, 30+((a+1) * y_offset_tft));
        gfx->print(ausgabe);
      }
      else {
        gfx->setCursor(5, 30+(7 * y_offset_tft));
        gfx->print(menuepunkte_2[a]);
      }
      a++;
    }
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == false) {
      while(EncoderButtonPressed());
      switch (menuitem) { 
        case 0: initRotaries(SW_MENU, current_servo, 0, 1500, 50);
                break;
        case 1: if (current_servo == 0) {initRotaries(SW_MENU, show_current, 0, 1, 1);}
                break;
      }
      wert_aendern = true;
    }
    // Änderung im Menupunkt übernehmen
    if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == true) {
      while(EncoderButtonPressed());
      initRotaries(SW_MENU, menuitem, 0, menuitem_used, -1);
      wert_aendern = false;
    }
    // Menu verlassen 
    if (EncoderButtonPressed() && menuitem == 6) {
      while(EncoderButtonPressed());
      gfx->setCursor(283, 30+(7 * y_offset_tft));
      gfx->print("OK");
      delay(1000);
      modus = -1;
      i = 0;
    }
    while (j > 0) {
      if (digitalRead(SWITCH_SETUP) == LOW) {
        current_servo = lastcurrent;
        show_current = lastshow_current;
        modus = -1;
        return;
      }
      if (wert_aendern == false) {
        menuitem = getRotariesValue(SW_MENU);
        if (menuitem == menuitem_used) {
          menuitem = 6;
        }
      }
      menuitem_used = 1;
      if (j == 1) {
        gfx->fillScreen(COLOR_BACKGROUND);
        gfx->setTextColor(COLOR_TEXT);
        gfx->setFont(Punk_Mono_Bold_240_150);
        x_pos = CenterPosX(title, 14, 320);
        gfx->setCursor(x_pos, 25);
        gfx->println(title);
        gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
        gfx->setCursor(5, 30+(3 * y_offset_tft));
        sprintf(ausgabe,"max. Strom:     %4imA", current_servo - 30);
        gfx->print(ausgabe);
        gfx->setCursor(5, 30+(4 * y_offset_tft));
        sprintf(ausgabe,"min. Winkel:      %3i°", winkel_min);
        gfx->print(ausgabe);
        j++;
      }
      if (wert_aendern == false && menuitem < menuitem_used && kalibration_status == "Start") {
        gfx->setTextColor(COLOR_MARKER);
        gfx->setCursor(5, 30+(1 * y_offset_tft));
        gfx->print(kalibration_status);
        gfx->setTextColor(COLOR_TEXT);
        gfx->setCursor(5, 30+(7 * y_offset_tft));
        gfx->print("Zurück");
      }
      else {
        gfx->setTextColor(COLOR_TEXT);
        gfx->setCursor(5, 30+(1 * y_offset_tft));
        gfx->print(kalibration_status);
        gfx->setTextColor(COLOR_MARKER);
        gfx->setCursor(5, 30+(7 * y_offset_tft));
        gfx->print("Zurück");
      }
      if (wert_aendern == true && menuitem < menuitem_used) {
        lastcurrent = current_servo;
        kalibration_status = "Kalibration läuft";
        quetschhan = "zu";
        cal_done = false;
        cal_winkel = 0;
        k = 1;
      }
      if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == false) {
        while(EncoderButtonPressed());
        wert_aendern = true;
      }
      // Änderung im Menupunkt übernehmen
      if (EncoderButtonPressed() && menuitem < menuitem_used  && wert_aendern == true) {
        while(EncoderButtonPressed());
        initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
        wert_aendern = false;
      }
      //verlassen
      if ((EncoderButtonPressed() && menuitem == 6) or digitalRead(BUTTON_STOP) == HIGH) {
        while(EncoderButtonPressed() or digitalRead(BUTTON_STOP) == HIGH);
        gfx->fillScreen(COLOR_BACKGROUND);
        x_pos = CenterPosX(title, 14, 320);
        gfx->setCursor(x_pos, 25);
        gfx->println(title);
        gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
        wert_aendern = false;
        menuitem_used = 2;
        initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
      }
      while (k > 0) {
        SERVO_WRITE(90);
        quetschhan = "offen";
        int scaletime = millis();
        bool measurement_run = false;
        while (!cal_done) {
          if (k == 1) {
            gfx->fillScreen(COLOR_BACKGROUND);
            gfx->setTextColor(COLOR_TEXT);
            gfx->setFont(Punk_Mono_Bold_240_150);
            x_pos = CenterPosX(title, 14, 320);
            gfx->setCursor(x_pos, 25);
            gfx->println(title);
            gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
            gfx->setCursor(5, 30+(3 * y_offset_tft));
            change = true;
            k++;
          }
          if (change) {
            gfx->setTextColor(COLOR_TEXT);
            gfx->setCursor(5, 30+(1 * y_offset_tft));
            gfx->print(kalibration_status);
            gfx->fillRect(205, 27+(3 * y_offset_tft)-19, 110, 3 * y_offset_tft, COLOR_BACKGROUND);
            gfx->setCursor(5, 30+(3 * y_offset_tft));
            sprintf(ausgabe,"Strom:          %4imA", current_mA);
            gfx->print(ausgabe);
            gfx->setCursor(5, 30+(4 * y_offset_tft));
            sprintf(ausgabe,"Winkel:           %3i°", cal_winkel);
            gfx->print(ausgabe);
            gfx->setCursor(5, 30+(5 * y_offset_tft));
            sprintf(ausgabe,"Quetschhan:      %5s", quetschhan);
            gfx->print(ausgabe);
            gfx->setTextColor(COLOR_MARKER);
            gfx->setCursor(5, 30+(7 * y_offset_tft));
            gfx->print("Abbrechen");
            change = false;
          }
          if (millis() - scaletime >= 800 and !measurement_run) {
            SERVO_WRITE(cal_winkel);
            quetschhan = "zu";
            measurement_run = true;
            scaletime = millis();
            change = true;
          }
          else if (millis() - scaletime >= 800 and measurement_run) {
            current_mA = GetCurrent(50);
            if (current_mA > current_servo - 30) {   //30mA unter dem max. Wert Kalibrieren
              SERVO_WRITE(90);
              quetschhan = "offen";
              cal_winkel++;
              change = true;
            }
            else {
              cal_done = true;
              kalibration_status = "Kalibration beendet";
              winkel_min = cal_winkel;
              k++;
            }
            measurement_run = false;
            scaletime = millis();
          }
          //verlassen
          if (EncoderButtonPressed() or digitalRead(BUTTON_STOP) == HIGH) {
            while(EncoderButtonPressed() or digitalRead(BUTTON_STOP) == HIGH);
            gfx->fillScreen(COLOR_BACKGROUND);
            gfx->setTextColor(COLOR_TEXT);
            x_pos = CenterPosX(title, 14, 320);
            gfx->setCursor(x_pos, 25);
            gfx->println(title);
            gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
            k = 0;
            winkel_min = lastwinkel_min;
            cal_done = true;
            wert_aendern = false;
            menuitem_used = 2;
            initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
          }
        }
        while (cal_done and k > 1) {
          current_mA = GetCurrent(50);
          if (wert_old != current_mA) {
            change = true;
            wert_old = current_mA;
          }
          if (k==2) {
            gfx->setTextColor(COLOR_TEXT);
            gfx->fillRect(0, 27+(1 * y_offset_tft)-19, 320, 25, COLOR_BACKGROUND);
            gfx->fillRect(0, 27+(5 * y_offset_tft)-19, 320, 25, COLOR_BACKGROUND);
            gfx->fillRect(0, 27+(7 * y_offset_tft)-19, 320, 25, COLOR_BACKGROUND);
            gfx->setCursor(5, 30+(1 * y_offset_tft));
            gfx->print(kalibration_status);
            gfx->setTextColor(COLOR_MARKER);
            gfx->setCursor(5, 30+(7 * y_offset_tft));
            gfx->print("Speichern");
            gfx->setTextColor(COLOR_TEXT);
            k++;
          }
          if (change) {
            gfx->fillRect(200, 27+(3 * y_offset_tft)-19, 120, 25, COLOR_BACKGROUND);
            gfx->setCursor(5, 30+(3 * y_offset_tft));
            sprintf(ausgabe,"Strom:          %4imA", current_mA);
            gfx->print(ausgabe);
            change = false;
          }
          //verlassen
          if (digitalRead(BUTTON_STOP) == HIGH) {
            while(digitalRead(BUTTON_STOP) == HIGH);
            k = 0;
            wert_aendern = false;
            menuitem_used = 2;
            winkel_min = lastwinkel_min;
            initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
            gfx->fillScreen(COLOR_BACKGROUND);
            x_pos = CenterPosX(title, 14, 320);
            gfx->setCursor(x_pos, 25);
            gfx->println(title);
            gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
          }
          if (EncoderButtonTapped()) {
            k = 0;
            modus = -1;
            wert_aendern = false;
            menuitem_used = 2;
            initRotaries(SW_MENU, 0, 0, menuitem_used, -1);
            setPreferences();
            return;
          }
        }
      }
    }
  }
}

void processSetup(void) {
  int x_pos;
  int MenuepunkteAnzahl = 10;
  int menuitem_old = -1;
  //if (bINA219_installed) {MenuepunkteAnzahl++;}
  int posmenu[MenuepunkteAnzahl];
  const char *menuepunkte[MenuepunkteAnzahl] = {"1-Tarawerte","2-Kalibrieren","3-Füllmenge","4-Automatik","5-Servoeinst.","6-Parameter","7-Zählwerk","8-ZählwerkTrip","9-INA219 Setup", "10-Clear Prefs"};
  //MenuepunkteAnzahl = sizeof(menuepunkte)/sizeof(menuepunkte[0]);
  //if (bINA219_installed) {
  //    menuepunkte[MenuepunkteAnzahl - 1] = menuepunkte[MenuepunkteAnzahl -2];    //Clear Pref eins nach hinten schieben
  //    menuepunkte[MenuepunkteAnzahl - 2] = "INA219 Setup";
  //}
  modus = MODE_SETUP;
  winkel = winkel_min;          // Hahn schliessen
  servo_aktiv = 0;              // Servo-Betrieb aus
  SERVO_WRITE(winkel);
  rotary_select = SW_MENU;
  initRotaries(SW_MENU, lastpos, -1, MenuepunkteAnzahl, 1);
  while (modus == MODE_SETUP and (digitalRead(SWITCH_SETUP)) == HIGH) {
  
  if(start_button_very_long_pressed > 200)
  { // pressed for > 4 seconds
     start_button_very_long_pressed = 0;
     bOldMenu = ! bOldMenu;
     break; // out of here
  }   



    if (rotaries[SW_MENU].Value < 0) {
      rotaries[SW_MENU].Value = (MenuepunkteAnzahl * ROTARY_SCALE) - 1;
    }
    else if (rotaries[SW_MENU].Value > ((MenuepunkteAnzahl * ROTARY_SCALE) - 1)) {
      rotaries[SW_MENU].Value = 0;
    }
    int menuitem = getRotariesValue(SW_MENU) % MenuepunkteAnzahl;
    for (i = 0; i < MenuepunkteAnzahl; i++) {
      posmenu[i] = (menuitem + i) % MenuepunkteAnzahl;
    }
    if (menuitem != menuitem_old) {
      gfx->fillScreen(COLOR_BACKGROUND);
      gfx->drawLine(0, 100, 320, 100, COLOR_TEXT);
      gfx->drawLine(0, 139, 320, 139, COLOR_TEXT);
      gfx->setTextColor(COLOR_TEXT);
      gfx->setFont(Punk_Mono_Bold_320_200);
      x_pos = CenterPosX(menuepunkte[posmenu[0]], 18, 320);
      gfx->setCursor(x_pos, 130);
      gfx->println(menuepunkte[posmenu[0]]);
      gfx->setTextColor(COLOR_MENU_POS1);
      gfx->setFont(Punk_Mono_Bold_240_150);
      x_pos = CenterPosX(menuepunkte[posmenu[MenuepunkteAnzahl-1]], 14, 320);
      gfx->setCursor(x_pos, 86);
      gfx->println(menuepunkte[posmenu[MenuepunkteAnzahl-1]]);
      x_pos = CenterPosX(menuepunkte[posmenu[1]], 14, 320);
      gfx->setCursor(x_pos, 169);
      gfx->println(menuepunkte[posmenu[1]]);
      gfx->setTextColor(COLOR_MENU_POS2);
      gfx->setFont(Punk_Mono_Bold_200_125);                   //9 x 11 Pixel
      x_pos = CenterPosX(menuepunkte[posmenu[MenuepunkteAnzahl-2]], 12, 320);
      gfx->setCursor(x_pos, 60);
      gfx->println(menuepunkte[posmenu[MenuepunkteAnzahl-2]]);
      x_pos = CenterPosX(menuepunkte[posmenu[2]], 12, 320);
      gfx->setCursor(x_pos, 192);
      gfx->println(menuepunkte[posmenu[2]]);
      gfx->setTextColor(COLOR_MENU_POS3);
      gfx->setFont(Punk_Mono_Bold_160_100);                   //7 x 9 Pixel
      x_pos = CenterPosX(menuepunkte[posmenu[MenuepunkteAnzahl-3]], 9, 320);
      gfx->setCursor(x_pos, 37);
      gfx->println(menuepunkte[posmenu[MenuepunkteAnzahl-3]]);    
      x_pos = CenterPosX(menuepunkte[posmenu[3]], 9, 320);
      gfx->setCursor(x_pos, 213);
      gfx->println(menuepunkte[posmenu[3]]);
      gfx->setTextColor(COLOR_MENU_POS4);
      gfx->setFont(Punk_Mono_Bold_120_075);                   //6 x 7 Pixel
      x_pos = CenterPosX(menuepunkte[posmenu[MenuepunkteAnzahl-4]], 7, 320);
      gfx->setCursor(x_pos, 16);
      gfx->println(menuepunkte[posmenu[MenuepunkteAnzahl-4]]);
      x_pos = CenterPosX(menuepunkte[posmenu[4]], 7, 320);
      gfx->setCursor(x_pos, 232);
      gfx->println(menuepunkte[posmenu[4]]);
      menuitem_old = menuitem;
    }
    lastpos = menuitem;
    if (EncoderButtonTapped()) {
    #ifdef isDebug 
      Serial.print("Setup Position: ");
      Serial.println(menuitem);
    #endif
      lastpos = menuitem;
      if (menuepunkte[menuitem] == "1-Tarawerte")     setupTara();              // Tara 
      if (menuepunkte[menuitem] == "2-Kalibrieren")   setupCalibration();       // Kalibrieren 
      if (menuepunkte[menuitem] == "3-Füllmenge")     setupFuellmenge();        // Füllmenge 
      if (menuepunkte[menuitem] == "4-Automatik")     setupAutomatik();         // Autostart/Autokorrektur konfigurieren 
      if (menuepunkte[menuitem] == "5-Servoeinst.")   setupServoWinkel();       // Servostellungen Minimum, Maximum und Feindosierung
      if (menuepunkte[menuitem] == "6-Parameter")     setupParameter();         // Sonstige Einstellungen
      if (menuepunkte[menuitem] == "7-Zählwerk")      setupCounter();           // Zählwerk
      if (menuepunkte[menuitem] == "8-ZählwerkTrip")  setupTripCounter();       // Zählwerk Trip
      if (menuepunkte[menuitem] == "9-INA219 Setup")  setupINA219();            // INA219 Setup
      setPreferences();
      if (menuepunkte[menuitem] == "10-Clear Prefs")   setupClearPrefs();        // EEPROM löschen
      initRotaries(SW_MENU,lastpos, 0,255, -1);                               // Menu-Parameter könnten verstellt worden sein
    }
  }
}

void processAutomatik(void) {
  int zielgewicht;                 // Glas + Korrektur
  static int autokorrektur_gr = 0; 
  int erzwinge_servo_aktiv = 0;
  boolean voll = false;
  static int gewicht_vorher;       // Gewicht des vorher gefüllten Glases
  static int sammler_num = 5;      // Anzahl identischer Messungen für Nachtropfen
  int n;
  int y_offset = 0;
  if (modus != MODE_AUTOMATIK) {
     modus = MODE_AUTOMATIK;
     winkel = winkel_min;          // Hahn schliessen
     servo_aktiv = 0;              // Servo-Betrieb aus
     SERVO_WRITE(winkel);
     auto_aktiv = 0;               // automatische Füllung starten
     tara_glas = 0;
     rotary_select = SW_WINKEL;    // Einstellung für Winkel über Rotary
     offset_winkel = 0;            // Offset vom Winkel wird auf 0 gestellt
     initRotaries(SW_MENU, fmenge_index, 0, 4, 1);
     gewicht_vorher = Jars[fmenge_index].Gewicht + korrektur;
     int x_pos;
    if (current_servo > 0) {
      no_ina = true;
    }
    else {
      no_ina = false;
    }
    glas_alt = -1;
    current_mA_alt = -1;
    korr_alt = -99999;
    autokorr_gr_alt = -99999;
    winkel_min_alt = -1;
    pos_alt = -1;
    winkel_ist_alt = -1;
    servo_aktiv_alt = -1;
    auto_aktiv_alt = -1;
    gewicht_alt = -9999999;
    // gfx->fillScreen(COLOR_BACKGROUND);
    //gfx->setTextColor(COLOR_TEXT);
    //gfx->setFont(Punk_Mono_Bold_320_200);
    //sprintf(ausgabe,"Automatik");
    //x_pos = CenterPosX(ausgabe, 18, 320);
    //gfx->setCursor(x_pos, 27);
    //gfx->print(ausgabe);
    gfx->drawLine(0, 30, 320, 30, COLOR_TEXT);
    gfx->drawLine(0, 184, 320, 184, COLOR_TEXT);
    gfx->drawLine(160, 184, 160, 240, COLOR_TEXT);
    gfx->setCursor(2, 202);
    gfx->setFont(Punk_Mono_Thin_160_100);
    gfx->print("INA219");
    gfx->setFont(Checkbox);
    gfx->setCursor(140, 199);
    if (bINA219_installed == 0){
      gfx->setTextColor(RED);
      gfx->print("B");
    }
    else {
      gfx->setTextColor(GREEN);
      gfx->print("A");
    }
    gfx->setTextColor(COLOR_TEXT);
    gfx->setCursor(2, 219);
    gfx->setFont(Punk_Mono_Thin_160_100);
    gfx->print("Autostart");
    gfx->setFont(Checkbox);
    gfx->setCursor(140, 216);
    if (autostart == 0){
      gfx->setTextColor(RED);
      gfx->print("B");
    }
    else {
      gfx->setTextColor(GREEN);
      gfx->print("A");
    }
    gfx->setTextColor(COLOR_TEXT);
    gfx->setFont(Punk_Mono_Thin_160_100);
    gfx->setCursor(2, 236);
    gfx->print("Autokorrektur");
    gfx->setFont(Checkbox);
    gfx->setCursor(140, 233);
    if (autokorrektur == 0){
      gfx->setTextColor(RED);
      gfx->print("B");
    }
    else {
      gfx->setTextColor(GREEN);
      gfx->print("A");
    }
    gfx->setTextColor(COLOR_TEXT);
    gfx->setFont(Punk_Mono_Thin_160_100);
    gfx->setCursor(170, 202);
    gfx->print("Strom:");
    gfx->setCursor(170, 219);
    gfx->print("Korrektur:");
    gfx->setCursor(170, 236);
    gfx->print("Autokorr.:");
    gfx->setCursor(2, 47);
    //sprintf(ausgabe,"min:000°     max:000°      ist:000°", (winkel_min, winkel_max*pos/100));
    sprintf(ausgabe,"Min:         Max:         Ist:");
    gfx->print(ausgabe);
    gfx->drawLine(0, 50, 320, 50, COLOR_TEXT);
  }
  pos = getRotariesValue(SW_WINKEL);
  // nur bis winkel_fein regeln, oder über initRotaries lösen?
  if (pos < winkel_fein * 100 / winkel_max) {                      
    pos = winkel_fein * 100 / winkel_max;
    setRotariesValue(SW_WINKEL, pos);
  }
  korrektur    = getRotariesValue(SW_KORREKTUR);
  fmenge_index = getRotariesValue(SW_MENU);
  fmenge       = Jars[fmenge_index].Gewicht;
  tara         = JarTypes[fmenge_index].tarra;
  if (tara <= 0) { 
    auto_aktiv = 0;
  }
  // wir starten nur, wenn das Tara für die Füllmenge gesetzt ist!
  // Ein erneuter Druck auf Start erzwingt die Aktivierung des Servo
  if (deb_start_button && tara > 0) {
    while(deb_start_button)delay(10); // wait until button released
    if (auto_aktiv == 1) { 
      TFT_line_print(0, "AUTOMATIC FILLING");
      erzwinge_servo_aktiv = 1;
      #ifdef isDebug
        Serial.println("erzwinge Servo aktiv");      
      #endif
    }
    if(erzwinge_servo_aktiv)TFT_line_print(0, "AUTOMATIC FILLING");
    else TFT_line_print(0, "AUTOMATIC WAITING");
    auto_aktiv    = 1;                            // automatisches Füllen aktivieren
    rotary_select = SW_WINKEL;                    // falls während der Parameter-Änderung auf Start gedrückt wurde    
    setPreferences();                             // falls Parameter über den Rotary verändert wurden
    glas_alt = -1;                              // Glas Typ Farbe zurücksetzen fals markiert ist
    korr_alt = -99999;                          // Korrektur Farbe zurücksetzen fals markiert ist
  }
  if (deb_stop_button) {
    winkel      = winkel_min + offset_winkel;
    servo_aktiv = 0;
    auto_aktiv  = 0;
    tara_glas   = 0;
    TFT_line_print(0, "AUT0MATIC PAUSED");
  }

  gewicht = round(LoadCell.getData()) - tara;

