Frank-Bemelman/HaniMandl-for-ESP32DEV/src/hani-mandl-esp32dev.cpp
  if(IsPulsed(&bStopButtonPulsed))servo_aktiv = 0;
  if(IsPulsed(&bStartButtonPulsed))servo_aktiv = 1;

  if (servo_aktiv != servo_aktiv_alt) 
  { servo_aktiv_alt = servo_aktiv;
    if (servo_aktiv == 1)
    { TFT_line_print(0, "MANUAL MODE DOSING");
      TFT_line_blink(0, true);
      TFT_line_color(4, TFT_WHITE, TFT_DARKGREY); 
      TFT_line_color(5, TFT_GREEN, TFT_DARKGREY);
    }
    else 
    { TFT_line_print(0, "MANUAL MODE PAUSED");
      TFT_line_blink(0, false);
      TFT_line_color(4, TFT_WHITE, TFT_BLACK); 
      TFT_line_blink(4, true);
      tara_alt = -1; // force reprint without current shown
      TFT_line_color(5, TFT_WHITE, TFT_DARKGREY);
    }
  }

    // set tarra with encoder button
  if(IsPulsed(&bEncoderButtonPulsed))
  { if(servo_aktiv == 0) // only accept new tarra in paused mode
    SysParams[MANUALTARRA] = round(LoadCell.getData());
    SaveParameters();
  }

  // get encoder value
  pos = getRotariesValue(SW_WINKEL); // value 0-100  
  desired_angle = (winkel_max * pos) / 100;
  desired_angle = constrain(desired_angle, winkel_min + offset_winkel, winkel_max);

  // close valve in paused mode
  if(servo_aktiv == 0)SERVO_WRITE(winkel_min + offset_winkel);
  else SERVO_WRITE(desired_angle); // update valve
  
  // print the big weight in grams, NewWeight is used by new graphics handling
  NewWeight = round(LoadCell.getData()) - SysParams[MANUALTARRA];

  // tarra value & current value for servo, printed on one line
  if((SysParams[MANUALTARRA] != manualtarra_old) || (current_mA != current_mA_alt))
  { manualtarra_old = SysParams[MANUALTARRA];
    sprintf(text, "Tarra %dg", SysParams[MANUALTARRA]);
    if(servo_aktiv==1)
    { if(bINA219_installed && (current_mA != current_mA_alt))
      { if(show_current == 1)
        { sprintf(&text[strlen(text)], " Servo %dmA", current_mA);
        }
      }  
    }
    current_mA_alt = current_mA;
    TFT_line_print(4, text);
    if(servo_aktiv==0)TFT_line_blink(4, true);
  }

  // print allowable range and angle chosen for servo
  if(desired_angle != desired_angle_old)
  { desired_angle_old = desired_angle;
    sprintf(text, "Range %d°-%d° Servo %d°", (winkel_min + offset_winkel), winkel_max, desired_angle);
    TFT_line_print(5, text);
  }


  if (alarm_overcurrent) {i = 1;}
  while (i > 0) {
    inawatchdog = 0;                    //schalte die kontiunirliche INA Messung aus
    //Servo ist zu
    if (servo.read() <= winkel_min  + offset_winkel and offset_winkel < 3) {
      while(offset_winkel < 3 and current_servo < current_mA) {
        offset_winkel = offset_winkel + 1;
        SERVO_WRITE(winkel_min + offset_winkel);
        current_mA = GetCurrent(10);
        delay(1000);
      }
    }
    i = 0;
    inawatchdog = 1;
    alarm_overcurrent = 0;
  }
  //setPreferences();         //irgendwo anderst setzen. es muss nicht jede änderung geschrieben werden
}


volatile int interruptCounter;

hw_timer_t * timer = NULL;
portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR onTimer() // is called every 10mS
{ int x;
  
  portENTER_CRITICAL_ISR(&timerMux);
  interruptCounter++;

  // timer example
  // if(TimeOutMs)
  // { digitalWrite(SOLENOID, HIGH);
  //   TimeOutMs--;
  // }
  // else digitalWrite(SOLENOID, LOW);
  
  if((interruptCounter % 5)==0)bScrollNow = true; // 50ms ticker for the vertical scrolling of text

  if((interruptCounter % 10)==0)
  { bUpdateDisplay = true; // display refresh max 10 times a second
  }

  BlinkTimer10mS++;
  if(BlinkTimer10mS>25)
  { BlinkTimer10mS=0;
    bBlinkDisplay = !bBlinkDisplay;
  }

  if((interruptCounter % 100)==0) // each second
  { 
  }

  EncoderSleep10mS++;
    
  portEXIT_CRITICAL_ISR(&timerMux);
}

//interrupt routine:
void dataReadyISR() {
  if (LoadCell.update()) {
    newDataReady = 1;
  }
}

void setup() 
{ int wait;
  // timer for all sorts of things including lcd display updates
  timer = timerBegin(0, 80, true); // prescaler 1MHz
  timerAttachInterrupt(timer, &onTimer, true);
  timerAlarmWrite(timer, 10000, true); // elke 10mS
  timerAlarmEnable(timer);
  
  Serial.begin(115200);
  while (!Serial);
  Serial.println("Hanimandl Start");
  
  SetDefaultParameters(); // fills global array with all editable parameters
  LoadParameters(); // pull from eeprom what we have

  tft_colors();
  tft_marker();
  gfx->begin();
  gfx->fillScreen(COLOR_BACKGROUND);
  gfx->setUTF8Print(true);
    
  SetupMyDisplay(); // in hani-display.cpp
  delay(500);

  Serial.println("Pin Config");
  // enable internal pull downs for digital inputs 
  pinMode(BUTTON_START,INPUT_PULLDOWN);
  pinMode(BUTTON_STOP, INPUT_PULLDOWN);
  pinMode(SWITCH_AUTO, INPUT_PULLDOWN);
  pinMode(SWITCH_SETUP, INPUT_PULLDOWN);

  xTaskCreatePinnedToCore(
                    ReadButtons,    // Task to read and debounce buttons and switch 
                    "ReadButtons", // name of task
                    2000,           // Stack size of task 
                    NULL,           // parameter of the task 
                    1,              // priority of the task 
                    NULL,           // Task handle to keep track of created task 
                    0);             // pin task to core 0 

  
  // Check if we have a INA219 current sensor installed or not
  if (ina219.begin()) {
    bINA219_installed = true;
    TFT_line_print(1, "INA219 Installed!");
    TFT_line_color(1, TFT_BLACK, TFT_GREEN);
  }
  else {
    bINA219_installed = false;
    current_servo = 0;                              // ignore INA wenn keiner gefunden wird
    TFT_line_print(1, "INA219 Not Installed!");
    TFT_line_color(1, TFT_BLACK, TFT_RED);
    TFT_line_blink(1, true);
  }
  delay(500);

  // Rotary
  pinMode(ENCODER_BUTTON, INPUT_PULLUP);
  attachInterrupt(ENCODER_BUTTON, isr1, FALLING);
  pinMode(ROTARY_ENCODER_A,INPUT);
  pinMode(ROTARY_ENCODER_B,INPUT);
  attachInterrupt(ROTARY_ENCODER_A, isr2, CHANGE);
  // Buzzer
  pinMode(buzzer_pin, OUTPUT);
  pinMode(led_pin, OUTPUT);
  // short delay to let chip power up
  delay (100);
  // Preferences aus dem EEPROM lesen
  getPreferences();

  // servo setup initialisation
  servo.attach(SERVO_PIN,  500, 2500); // pulse range for 180 degrees range
//    servo.setPeriodHertz(50);
  SERVO_WRITE(winkel_min); // set valve to closed position

