Frank-Bemelman/HaniMandl-for-ESP32DEV/src/hani-mandl-esp32dev.cpp
  buzzer(BUZZER_SHORT);

  // new HX711 library used
  LoadCell.begin();
  LoadCell.start(3000, false);
  
  calibrationValue = faktor;
  LoadCell.setCalFactor(calibrationValue); 
  
  if(LoadCell.getTareTimeoutFlag())
  { waage_vorhanden = 0; // have check really
  }
  else 
  { waage_vorhanden = 1; // have check really
  }
  while (!LoadCell.update());
  Serial.print("Calibration value: ");
  Serial.println(LoadCell.getCalFactor());
  Serial.print("HX711 measured conversion time ms: ");
  Serial.println(LoadCell.getConversionTime());
  Serial.print("HX711 measured sampling rate HZ: ");
  Serial.println(LoadCell.getSPS());
  Serial.print("HX711 measured settlingtime ms: ");
  Serial.println(LoadCell.getSettlingTime());
  Serial.println("Note that the settling time may increase significantly if you use delay() in your sketch!");
  if (LoadCell.getSPS() < 7) {
    Serial.println("!!Sampling rate is lower than specification, check MCU>HX711 wiring and pin designations");
  }
  else if (LoadCell.getSPS() > 100) {
    Serial.println("!!Sampling rate is higher than specification, check MCU>HX711 wiring and pin designations");
  }




  attachInterrupt(digitalPinToInterrupt(HX711_dout), dataReadyISR, FALLING);

  // Setup der Waage, Skalierungsfaktor setzen
  if (waage_vorhanden ==1) {                         // Waage angeschlossen?
    if (faktor == 0) {                               // Vorhanden aber nicht kalibriert
      TFT_line_print(2, "Scale Not Calibrated!");
      TFT_line_color(2, TFT_BLACK, TFT_RED);
      TFT_line_blink(2, true);
      buzzer(BUZZER_ERROR);
    }
    else {                                          // Tara und Skalierung setzen
      // scale.set_scale(faktor);
      LoadCell.setCalFactor(calibrationValue); 
      // scale.set_offset(long(gewicht_leer));
      LoadCell.setTareOffset((long)(gewicht_leer));	

      TFT_line_print(2, "Scale Initialized!");
      TFT_line_color(2, TFT_BLACK, TFT_GREEN);
    }
  }
  else {                                            // Keine Waage angeschlossen
    TFT_line_color(2, TFT_BLACK, TFT_RED);
    TFT_line_print(2, "No Scale Connected!"); 
    TFT_line_blink(2, true);
    delay(5000);

    buzzer(BUZZER_ERROR);
  }
  delay(1000);

  // initiale Kalibrierung des Leergewichts wegen Temperaturschwankungen
  // Falls mehr als 20g Abweichung steht vermutlich etwas auf der Waage.
  if (waage_vorhanden == 1) {
    gewicht = round(LoadCell.getData());
    if ((gewicht > -20) && (gewicht < 20)) 
    {
      LoadCell.tare();
      buzzer(BUZZER_SUCCESS);
      #ifdef isDebugSCALE_GETUNITS
        Serial.print("Tara angepasst um: ");
        Serial.println(gewicht);
      #endif
    }
    else if (faktor != 0) {
      TFT_line_color(3, TFT_BLACK, TFT_RED);
      TFT_line_print(3, "Please Empty Scale"); 
      TFT_line_blink(3, true);
//      #ifdef isDebug
        Serial.print("Gewicht auf der Waage: ");
        Serial.println(gewicht);
        Serial.print("Faktor: ");
        Serial.println(faktor);
        Serial.print("Gewicht Leer: ");
        Serial.println(gewicht_leer);
        
//      #endif
      delay(5000);
      // Neuer Versuch, falls Gewicht entfernt wurde
      gewicht = round(LoadCell.getData());
      if ((gewicht > -20) && (gewicht < 20)) {
        LoadCell.tare();
        buzzer(BUZZER_SUCCESS);
        #ifdef isDebug
          Serial.print("Tara angepasst um: ");
          Serial.println(gewicht);
        #endif
      }
      else {    // Warnton ausgeben
        buzzer(BUZZER_LONG);
      }
    }
  }
  TFT_line_print(3, "Any Button To Skip"); 
  TFT_line_blink(3, true);
  
  IsPulsed(&bStartButtonPulsed); // reset the button flag
  IsPulsed(&bStopButtonPulsed); // reset the button flag
  IsPulsed(&bEncoderButtonPulsed); // reset the button flag
  IsPulsed(&bSetupSwitchPulsed); // reset the button flag
  IsPulsed(&bAutoSwitchPulsed); // reset the button flag
  IsPulsed(&bManualSwitchPulsed); // reset the button flag
   
  wait = 2000;
  while(wait)
  { wait -= 100;
    delay(100);
    if(IsPulsed(&bStartButtonPulsed))break; 
    if(IsPulsed(&bStopButtonPulsed))break; 
    if(IsPulsed(&bEncoderButtonPulsed))break; 
    if(IsPulsed(&bSetupSwitchPulsed))break; 
    if(IsPulsed(&bAutoSwitchPulsed))break; 
    if(IsPulsed(&bManualSwitchPulsed))break;
  }
  TFT_line_print(1, ""); // remove messages, warnings 
  TFT_line_print(2, ""); // remove messages, warnings 
  TFT_line_print(3, ""); // remove messages, warnings 
  
  if(wait)wait = 0;
  else wait = 60000;
  while(wait)
  { wait -= 100;
    delay(100);
    if(IsPulsed(&bStartButtonPulsed))break; 
    if(IsPulsed(&bStopButtonPulsed))break; 
    if(IsPulsed(&bEncoderButtonPulsed))break; 
    if(IsPulsed(&bSetupSwitchPulsed))break; 
    if(IsPulsed(&bAutoSwitchPulsed))break; 
    if(IsPulsed(&bManualSwitchPulsed))break;
  } 

  // die drei Datenstrukturen des Rotaries initialisieren
  initRotaries(SW_WINKEL,    0,   0, 100, 5);     // Winkel
  initRotaries(SW_KORREKTUR, 0, -90,  20, 1);     // Korrektur
  initRotaries(SW_MENU,      0,   0,   7, 1);     // Menuauswahlen
  // Parameter aus den Preferences für den Rotary Encoder setzen
  setRotariesValue(SW_WINKEL,    pos);   
  setRotariesValue(SW_KORREKTUR, korrektur);
  setRotariesValue(SW_MENU,      fmenge_index);
}

void loop() 
{  //INA219 Messung
  if (bINA219_installed and inawatchdog == 1 and (current_servo > 0 or show_current == 1) and (modus == MODE_HANDBETRIEB or modus == MODE_AUTOMATIK)) {
    ina219_measurement();
  }

  //Serial.println(start_button_very_long_pressed);

  if(start_button_very_long_pressed > 200)
  { // pressed for > 4 seconds
     start_button_very_long_pressed = 0;
     bOldMenu = ! bOldMenu;
  }   

  // Setup Menu 
  if(deb_setup_switch) 
  { if(bOldMenu)
    { if (modus != MODE_SETUP)
      { ActLcdMode = 999; // force display build
        SelectMenu(HANI_SETUP);
      } 
      processSetup();
    }
    else Menu(); // new menu style
  }
  // Automatik-Betrieb 
  else if(deb_auto_switch) {
//    if (modus != MODE_AUTOMATIK)
//    { ActLcdMode = 999; // force new display build
//      SelectMenu(HANI_AUTO);
//    }
    processAutomatik2();
    delay(10);
  }
  // Handbetrieb 
  else if(deb_manual_switch) 
  { if (modus != MODE_HANDBETRIEB)
    { ActLcdMode = 999; // force new display build
      SelectMenu(HANI_HAND);
    }
    processHandbetrieb();
  }
}


